//MGDB05SA JOB 00009999,MGDB05,CLASS=A,MSGCLASS=T,NOTIFY=&SYSUID,       JOB01602
//             REGION=0M
//*
//DELETE   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE MGDB05.ISPF.CLISTUDB.IEB
  DELETE MGDB05.ISPF.CLISTUDB.XMIT
  IF LASTCC LE 8 THEN SET MAXCC = 0
/*
//GENDSN1  EXEC ISPFBAT
//SYSEXEC  DD DISP=SHR,DSN=MGDB05.ISPF.CLISTUDB
//SYSUT1   DD DISP=SHR,DSN=MGDB05.ISPF.CLISTUDB
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),UNIT=SYSALLDA,VOL=SER=MGDB05,
//          SPACE=(CYL,(10,10)),DCB=(LRECL=80,BLKSIZE=0,RECFM=FB),
//          DATACLAS=SEQFB,
//          DSN=MGDB05.ISPF.CLISTUDB.IEB
//SYSPRINT DD SYSOUT=*
//MEMLIST  DD DUMMY
//SYSTSIN  DD *
  ISPSTART CMD(%GENIEBUP  ALL  )
/*
//TRANSMIT EXEC PGM=IKJEFT01,DYNAMNBR=30
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
PROFILE NOPREFIX
XMIT NWR.MGDB05 DSN('MGDB05.ISPF.CLISTUDB') -
OUTDSN('MGDB05.ISPF.CLISTUDB.XMIT')
/*
//MOVEDSN  EXEC PGM=ADRDSSU
//SYSPRINT DD   SYSOUT=A
//SYSIN    DD   *
 COPY DATASET(INCLUDE(  MGDB05.ISPF.CLISTUDB.XMIT             -
             )       )                                        -
      OUTDYNAM(MGDB05)                                        -
      ALLEXCP                                                 -
      PROCESS(SYS1)                                           -
      ALLDATA(*)                                              -
      DELETE CATALOG
/*
