/* rexx */
Address TSO "NEWSTACK" /* start a new (empty) stack */
Parse Value '; 2500 4092 4096 VB SYSDA ' || ,
            '33 256 NAMES C SECOND TIME',
With DSNESV2B DSNESV2D DSNESV2C DSNESV21 DSNESV22 DSNESV2E,
DSNESV24 DSNESV25 DSNESV26 DSNESV3Z DSNESV1W
Address "ISPEXEC"
"VPUT (DSNESV2B DSNESV2D DSNESV2C DSNESV21 DSNESV22 DSNESV2E",
"DSNESV24 DSNESV25 DSNESV26 DSNESV3Z DSNESV1W) PROFILE"
Push ''
Push 'END'
Push 'SPUFI'

"SELECT CMD(DSN SYSTEM("DB4E") TEST(0) RETRY(0))"
Address TSO "DELSTACK" /* finished with that stack */
