/* REXX */
/*******************************************************************/
/*                                                                 */
/* ProgramNAME      : ZOSB1925                                     */
/* AUSRUF           : Procedure  x=ZOSB1925(ssid,loc,ausw,obj)     */
/* AUTHER           : ULRICH BRAEUER                               */
/* FUNKTION         : Alter Object                                 */
/*                                                                 */
/*                                                                 */
/*******************************************************************/

SIGNAL ON FAILURE
SIGNAL ON ERROR
SIGNAL OFF FAILURE
SIGNAL OFF ERROR

PARSE SOURCE SRC.1  , /* ENVIRONMENT  (TSO)            */
             SRC.2  , /* AUFRUF ALS (COMMAND)          */
             SRC.3  , /* Program NAME (LUW97000)       */
             SRC.4  , /* SYS00186 (TEMP FILE)          */
             SRC.5  , /* AUFRUF AUS LIB (X.X.CLISTUDB) */
             SRC.6  , /* ?                             */
             SRC.7  , /* TSO                           */
             SRC.8  , /* ISPF                          */
             SRC.9  , /* ?                             */


ENV        = "TSO"
X          = MSG('OFF')
USER       = USERID()
SYSCATS    = "SYSCAT"
SYSIBMS    = "SYSIBM"
SYSIBMA    = "SYSIBMADM"
SYSPROCA   = "SYSPROC"
RECLEN     = 4096
TRACKS     = 60
DSNRECON   = "N"
SYSUID  = ""
SYSPWD  = ""
ADDRESS ISPEXEC 'VGET (ALTERJOB) PROFILE'
ADDRESS ISPEXEC 'VGET (DSNRECON) PROFILE'
ADDRESS ISPEXEC 'VGET (TRACKS) PROFILE'
ADDRESS ISPEXEC 'VGET (RECLEN) PROFILE'
ADDRESS ISPEXEC 'VGET (SYSIBMS) PROFILE'
ADDRESS ISPEXEC 'VGET (SYSCATS) PROFILE'
ADDRESS ISPEXEC 'VGET (SYSIBMA) PROFILE'
ADDRESS ISPEXEC 'VGET (SYSPROCA) PROFILE'
ADDRESS ISPEXEC 'VGET (SYSUID)   PROFILE'
ADDRESS ISPEXEC 'VGET (SYSPWD)   PROFILE'

ADDRESS ISPEXEC 'VGET (UDBTRACE) PROFILE'
IF UDBTRACE = 'ON' THEN TRACE R
ELSE                    TRACE

red   = '01'x                              /* Assign colors to       */
blue  = '02'x                              /*   Attribute bytes      */
green = '03'x                              /*   found in the data    */
white = '04'x
in1   = '05'x
in2   = '06'x
in3   = '07'x
uid   = '08'x
pwd   = '09'x
endin = '3a'x
keyw  = '3b'x
maxlines = 0                               /* set max number of lines*/
dyndata  = ''                              /* initialize data        */
cmddata  = ''                              /* initialize data        */
curline = 1                                /* set current line #     */

keytab.0 = 5
keytab.1 = in1
keytab.2 = in2
keytab.3 = in3
keytab.4 = uid
keytab.5 = pwd

stmt              = ""
ddltext           = ""

ssid        = arg(1)
location    = arg(2)
auswkz      = arg(3)
lnr         = arg(4)
tabnr       = arg(5)
ISPFILE     = arg(6)
Do_All      = arg(7)
eingabe     = arg(8)
eingabe2    = arg(9)
statement   = arg(10)
object1     = arg(11)
object2     = arg(12)
object3     = arg(13)
object4     = arg(14)
object5     = arg(15)
EDIT        = arg(16)
Object_list = arg(17)
DB2Vers     = arg(18)
proclib     = arg(19)
curnr       = arg(20)   /* Cursor Nummer der Zeile in ISPF-TAB */
obj         = ""
tablespace  = ""
DB2_SSID    = SSID
listtb = ListObject

crlf   = "0a0d"x
crlf   = '0a0d'x

drop al.
al.0  = 0
drop sl.
sl.0 = 0

CZeile  = ""
If Datatype(Curnr) = "NUM" Then do
   tabnr = tabnr -1  /* Aktuelle Table in ZOSB1210 verwendet */
   LUWTABLE       = "LUWTB"tabnr
   COLTAB         = "COLTB"tabnr
   TBCOL          = "TBCOL"tabnr
   address ispexec 'TBOPEN  'COLTAB
   address ispexec 'TBTOP   'COLTAB
   address ispexec 'TBSKIP  'COLTAB' NUMBER('curnr')'
   address ispexec 'TBGET   'COLTAB
   address ispexec 'TBCLOSE 'COLTAB
 End


RXDB2_SSID        = SSID
RXDB2_GETSTEM     = 'EINGABE.'
RXDB2_PUTSTEM     = 'AUSGABE.'
ANZAHL_ROWS       = 0

SELTAB         = "SELTB" || tabnr
ALTAB          = "ALTER" || tabnr
address ispexec  'TBERASE 'ALTAB
If RC > 12  Then do
   say "Error on TBERASE RC="RC "TABLE="ALTAB
 End
address ispexec  'TBOPEN 'ALTAB
if rc /= 0 then Do
   ADDRESS ISPEXEC "TBCREATE "ALTAB   ,
                   " KEYS(NAME)             ",
                   " NAMES(OVal, NVal) ",
                   " REPLACE"
 End


parse value DB2Vers with DBENV 4 DBVers 6 DBRel 8 DBMod
parse value Object1 with DB2_CREATOR1 '.' DB2_NAME1
parse value Object2 with DB2_CREATOR2 '.' DB2_NAME2
parse value Object3 with DB2_CREATOR3 '.' DB2_NAME3
parse value Object4 with DB2_CREATOR4 '.' DB2_NAME4
parse value Object5 with DB2_CREATOR5 '.' DB2_NAME5

eingabe3 = subword(eingabe2, 2)
eingabe2 = Word(eingabe2, 1)

Call Get_CFG_FILE

RLIB    = 'N'

IF Substr(ALTERJOB, 1, 1) = "S" THEN EDIT = "YES"
 Else                                EDIT = "NO"


select
  when auswkz = 'SG' & eingabe   = "ALTER" Then do
       CALL Alter_Stogroup
   End
  when auswkz = 'DB' & eingabe   = "ALTER" Then do
       CALL Alter_Database
   End
  when auswkz = 'TS' & eingabe   = "ALTER" Then do
       CALL Alter_Tablespace
   End
  when auswkz = 'SE' & eingabe   = "ALTER" Then do
       CALL Alter_Sequence
   End
  when auswkz = 'TG' & eingabe   = "ALTER" Then do
       CALL Alter_Trigger
   End
  when auswkz = 'VW' & eingabe   = "ALTER" Then do
       CALL Alter_View
   End
  when auswkz = 'BP' & eingabe   = "ALTER" Then do
       EDIT   = "NO"
       CALL Alter_BufferPool
       db2cmd = "Y"
   End
  when auswkz = 'TB' & eingabe   = "ALTER" Then do
       CALL Alter_Table
   End
  when auswkz = 'IX' & eingabe   = "ALTER" Then do
       CALL Alter_Index
   End
  when auswkz = 'CO' & eingabe   = "ALTER" Then do
       CALL Alter_Column
   End
  when auswkz = 'RT' & eingabe   = "ALTER" Then Do
       CALL Alter_Routine
   End
  when auswkz = 'PERM' & eingabe   = "ALTER" Then do
       CALL Alter_Ppermission
   End
  when EINGABE = 'CM'                        Then do
       CALL COMMENT_On_Object
   End
  when EINGABE = 'LAB'                       Then do
       CALL COMMENT_On_Object
   End
  when EINGABE = 'CALL'                      Then do
       CALL Call_Sored_Procedure
   End
  Otherwise do
       anzcols = 0
   End
 End

If al.0 > 0 Then Do
   If  db2cmd = "Y" Then  Call Build_Ausgabe2
    Else                  Call Build_Ausgabe
 End

ADDRESS ISPEXEC "FTCLOSE NAME(" || MEM || ") LIBRARY(ISPFILE)"
If al.0 > 0 Then do
   ADDRESS ISPEXEC "EDIT DATASET('"CLMEM"') PANEL(ISREFR01)"
 End

if anzcols = 0 THEN RETURN 12
if EDIT = "YES" THEN Call Edit_Stmt  /* Anzeige Erwuenscht */


Return Stmt

Build_Ausgabe:

MEM     = "ALTEROBJ"
SKEL    = "SKALTS9"
JOB     = "Y"
STMT    = "N"
STOSTA  = "N"
OK    =  LISTDSI(ISPFILE "FILE")
If SYSDSNAME = "" Then do
   ADDRESS "TSO" "ALLOC F(ISPFILE) DA('"ISPFILE"') SHR"
 End
CLMEM = Strip(ISPFILE) || "(" || MEM || ")"

ADDRESS ISPEXEC 'FTOPEN'
If rc > 4 Then Do
  Say 'FTOPEN   RC='RC
  Say 'ZERRSM = 'ZERRSM
  Say 'ZERRLM = 'ZERRLM
 End

JOB  = "Y"
STMT = "N"
ADDRESS ISPEXEC 'FTINCL 'SKEL
If rc > 4 Then Do
  Say 'FTINCL   'SKEL 'RC='RC
  Say 'ZERRSM = 'ZERRSM
  Say 'ZERRLM = 'ZERRLM
 End

Do i = 1 to al.0
   JOB  = "N"
   STMT = "Y"
   SQLSTMT = al.i
   ADDRESS ISPEXEC 'FTINCL 'SKEL
   If rc > 4 Then Do
     Say 'FTINCL   'SKEL 'RC='RC
     Say 'ZERRSM = 'ZERRSM
     Say 'ZERRLM = 'ZERRLM
    End
 End

Return

Build_Ausgabe2:

MEM     = "ALTEROBJ"
SKEL    = "SKALTS1"
JOB     = "Y"
STMT    = "N"
END     = "N"
OK    =  LISTDSI(ISPFILE "FILE")
If SYSDSNAME = "" Then do
   ADDRESS "TSO" "ALLOC F(ISPFILE) DA('"ISPFILE"') SHR"
 End
CLMEM = Strip(ISPFILE) || "(" || MEM || ")"

ADDRESS ISPEXEC 'FTOPEN'
If rc > 4 Then Do
  Say 'FTOPEN   RC='RC
  Say 'ZERRSM = 'ZERRSM
  Say 'ZERRLM = 'ZERRLM
 End

JOB  = "Y"
STMT = "N"
END  = "N"
ADDRESS ISPEXEC 'FTINCL 'SKEL
If rc > 4 Then Do
  Say 'FTINCL   'SKEL 'RC='RC
  Say 'ZERRSM = 'ZERRSM
  Say 'ZERRLM = 'ZERRLM
 End

Do i = 1 to al.0
   JOB  = "N"
   STMT = "Y"
   SQLSTMT = al.i
   ADDRESS ISPEXEC 'FTINCL 'SKEL
   If rc > 4 Then Do
     Say 'FTINCL   'SKEL 'RC='RC
     Say 'ZERRSM = 'ZERRSM
     Say 'ZERRLM = 'ZERRLM
    End
 End

JOB     = "N"
STMT    = "N"
END     = "Y"
ADDRESS ISPEXEC 'FTINCL 'SKEL
If rc > 4 Then Do
   Say 'FTINCL   'SKEL 'RC='RC
   Say 'ZERRSM = 'ZERRSM
   Say 'ZERRLM = 'ZERRLM
 End

Return

Alter_Tablespace:
DB      = DB2_CREATOR1
TS      = DB2_NAME1

MEM     = "ALTERTS1"
SKEL    = "SKALTS9"

SQLSTMT   = "SELECT TS.DBNAME                              ",
            "   ,   TS.NAME                                ",
            "   ,   TS.BPOOL                               ",
            "   ,   TS.SBCS_CCSID                          ",
            "   ,   CASE WHEN TS.ERASERULE = 'Y' THEN 'YES'",
            "            ELSE 'NO'                         ",
            "        END AS       ERASERULE                ",
            "   ,   CASE WHEN TS.CLOSERULE = 'Y' Then 'YES' ",
            "            ELSE 'NO'                         ",
            "        END AS    CLOSERULE                   ",
            "   ,   CASE WHEN TS.LOG       = 'Y' Then 'YES' ",
            "            ELSE 'NO'                         ",
            "        END AS    LOG                         ",
            "   ,   CASE WHEN TS.LOCKRULE  = 'R' Then 'ROW' ",
            "            WHEN TS.LOCKRULE  = 'A' Then 'ANY' ",
            "            WHEN TS.LOCKRULE  = 'L' Then 'LARGE'    ",
            "            WHEN TS.LOCKRULE  = 'P' Then 'PAGE'     ",
            "            WHEN TS.LOCKRULE  = 'S' Then 'TABLESPACE'",
            "            ELSE 'TABLE'                      ",
            "        END AS    LOCKSIZE                    ",
            "   ,   TP.PARTITION                           ",
            "   ,   CASE WHEN TP.COMPRESS = 'Y' Then 'YES' ",
            "            ELSE 'NO'                         ",
            "        END AS COMPRESS                       ",
            "   ,   CASE WHEN TP.TRACKMOD = 'Y' Then 'YES' ",
            "            ELSE 'NO'                         ",
            "        END AS TRACKMOD                       ",
            "   ,   CASE WHEN TP.PQTY < 0 THEN TP.PQTY     ",
            "            ELSE TP.PQTY * 4                  ",
            "        END AS PQTY                           ",
            "   ,   CASE WHEN SQTY < 0 THEN TP.SQTY        ",
            "            ELSE TP.SQTY * 4                  ",
            "        END AS SQTY                           ",
            "   ,    FREEPAGE                              ",
            "   ,    PCTFREE                               ",
            "   ,    GBPCACHE                              ",
            "   ,    TP.STORNAME                           ",
            "   ,    TS.TYPE                               ",
            "   ,    TS.MAXPARTITIONS                      ",
            "   ,    TS.MAXROWS                            ",
            "   ,    TS.DSSIZE/1024/1024 AS DSSIZE         ",
            "   ,    TS.SEGSIZE                            ",
            "   ,    TS.LOCKMAX                            ",
            "   ,    TS.MEMBER_CLUSTER                     ",
            "FROM "SYSIBMS".SYSTABLESPACE     TS           ",
            "INNER JOIN "SYSIBMS".SYSTABLEPART TP          ",
            "ON  TS.DBNAME = TP.DBNAME                     ",
            "AND TS.NAME   = TP.TSNAME                     ",
            "where TS.DBNAME = '"DB2_CREATOR1"'            ",
            "And   TS.NAME   = '"DB2_NAME1"'               ",
            "ORDER BY TS.DBNAME, TS.NAME, TP.PARTITION     ",
            ""

ADDRESS ISPEXEC  'TBCLOSE 'SELTAB
OAUSWKZ = AUSWKZ
oobject = object
AUSWKZ  = "SQLEX"
object  = sqlstmt
call LESEN_DATEN
AUSWKZ  = oAUSWKZ
object  = oobject

ADDRESS ISPEXEC  'TBOPEN  'SELTAB
ADDRESS ISPEXEC  'TBTOP   'SELTAB
ADDRESS ISPEXEC  'TBSKIP  'SELTAB
If RC     <> 0 Then return

DB      = DB2_CREATOR1
TS      = DB2_NAME1
Drop Ausgabe.0
Ausgabe.0 = 0

do while rc = 0
   ausgabe.0 = Ausgabe.0 + 1
   ai        = Ausgabe.0
   Ausgabe.ai.DBNAME         =  col1
   Ausgabe.ai.NAME           =  col2
   Ausgabe.ai.BPOOL          =  col3
   Ausgabe.ai.SBCS_CCSID     =  col4
   Ausgabe.ai.ERASERULE      =  col5
   Ausgabe.ai.CLOSERULE      =  col6
   Ausgabe.ai.LOG            =  col7
   Ausgabe.ai.LOCKSIZE       =  col8
   Ausgabe.ai.PARTITION      =  col9
   Ausgabe.ai.COMPRESS       =  col10
   Ausgabe.ai.TRACKMOD       =  col11
   Ausgabe.ai.PQTY           =  col12
   Ausgabe.ai.SQTY           =  col13
   Ausgabe.ai.FREEPAGE       =  col14
   Ausgabe.ai.PCTFREE        =  col15
   Ausgabe.ai.GBPCACHE       =  col16
   Ausgabe.ai.STORNAME       =  col17
   Ausgabe.ai.TYPE           =  col18
   Ausgabe.ai.MAXPARTITIONS  =  col19
   Ausgabe.ai.MAXROWS        =  col20
   Ausgabe.ai.DSSIZE         =  col21
   Ausgabe.ai.SEGSIZE        =  col22
   Ausgabe.ai.LOCKMAX        =  col23
   Ausgabe.ai.MEMBER_CLUSTER =  Col24
   ADDRESS ISPEXEC  'TBSKIP  'SELTAB

   SELECT
      WHEN Ausgabe.ai.MEMBER_CLUSTER = 'Y' Then DO
           Ausgabe.ai.MEMBER_CLUSTER = 'YES'
       End
      OTHERWISE Do
           Ausgabe.ai.MEMBER_CLUSTER = 'NO'
       End
   END

   SELECT
      WHEN Ausgabe.ai.GBPCACHE       = 'A' Then
           Ausgabe.ai.GBPCACHE       = 'ALL'
      WHEN Ausgabe.ai.GBPCACHE       = 'S' Then
           Ausgabe.ai.GBPCACHE       = 'SYSTEM'
      WHEN Ausgabe.ai.GBPCACHE       = 'N' Then
           Ausgabe.ai.GBPCACHE       = 'NONE'
      OTHERWISE Do
           Ausgabe.ai.GBPCACHE       = 'CHANGED'
       End
   END

 End
ADDRESS ISPEXEC  'TBCLOSE 'SELTAB

If AUSGABE.1.TYPE =  "G" Then Do   /* partition by growth */
   AUSGABE.0              =  1
   AUSGABE.1.PARTITIONS   =  0
 End

TSNAME = AUSGABE.1.NAME
DBNAME = AUSGABE.1.DBNAME

NVAL = ''
address ISPEXEC 'TBCLOSE 'ALTAB
address ISPEXEC 'TBOPEN  'ALTAB


NAME ='BUFFERPOOL'
OVal = Ausgabe.1.BPOOL
NVal = Ausgabe.1.BPOOL
ADDRESS ISPEXEC 'TBADD 'ALTAB


NAME ='CCSID     '
OVal = Ausgabe.1.SBCS_CCSID
NVal = Ausgabe.1.SBCS_CCSID
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='CLOSE     '
OVal = Ausgabe.1.CLOSERULE
NVal = Ausgabe.1.CLOSERULE
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='LOGGED    '
OVal = Ausgabe.1.LOG
NVal = Ausgabe.1.LOG
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='LOCKSIZE  '
OVal = Ausgabe.1.LOCKSIZE
NVal = Ausgabe.1.LOCKSIZE
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='MAXROWS   '
OVal = Ausgabe.1.MAXROWS
NVal = Ausgabe.1.MAXROWS
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='MAXPARTITIONS '
OVal = Ausgabe.1.MAXPARTITIONS
NVal = Ausgabe.1.MAXPARTITIONS
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='DSSIZE    '
OVal = Ausgabe.1.DSSIZE || "G"
NVal = Ausgabe.1.DSSIZE || "G"
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='SEGSIZE       '
OVal = Ausgabe.1.SEGSIZE
NVal = Ausgabe.1.SEGSIZE
ADDRESS ISPEXEC 'TBADD 'ALTAB

If     Ausgabe.1.LOCKMAX  = -1 Then Ausgabe.1.LOCKMAX = "SYSTEM"
NAME ='LOCKMAX       '
OVal = Ausgabe.1.LOCKMAX
NVal = Ausgabe.1.LOCKMAX
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='STOGROUP         '
OVal = Ausgabe.1.STORNAME
NVal = Ausgabe.1.STORNAME
ADDRESS ISPEXEC 'TBADD 'ALTAB

NAME ='MEMBER CLUSTER '
OVal = Ausgabe.1.MEMBER_CLUSTER
NVal = Ausgabe.1.MEMBER_CLUSTER
ADDRESS ISPEXEC 'TBADD 'ALTAB

If If Ausgabe.1.MAXPARTITIONS  > 0 THEN Ausgabe.0 = 1
Do TPI  = 1 to Ausgabe.0
   NAME ='P ' || Ausgabe.TPI.PARTITION || '  PRIQTY'
   OVal = Ausgabe.TPI.PQTY
   NVal = Ausgabe.TPI.PQTY
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  SECQTY'
   OVal = Ausgabe.TPI.SQTY
   NVal = Ausgabe.TPI.SQTY
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  COMPRESS'
   OVal = Ausgabe.TPI.COMPRESS
   NVal = Ausgabe.TPI.COMPRESS
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  TRACKMOD'
   OVal = Ausgabe.TPI.TRACKMOD
   NVal = Ausgabe.TPI.TRACKMOD
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  FREEPAGE'
   OVal = Ausgabe.TPI.FREEPAGE
   NVal = Ausgabe.TPI.FREEPAGE
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  PCTFREE'
   OVal = Ausgabe.TPI.PCTFREE
   NVal = Ausgabe.TPI.PCTFREE
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  GBPCACHE'
   OVal = Ausgabe.TPI.GBPCACHE
   NVal = Ausgabe.TPI.GBPCACHE
   ADDRESS ISPEXEC 'TBADD 'ALTAB

   NAME ='P ' || Ausgabe.TPI.PARTITION || '  STOGROUP'
   OVal = Ausgabe.TPI.STORNAME
   NVal = Ausgabe.TPI.STORNAME
   ADDRESS ISPEXEC 'TBADD 'ALTAB
 End


address ispexec  'TBCLOSE 'ALTAB
address ispexec  'TBOPEN 'ALTAB
CURSOR = 'CURSOR(ZCMD)'
CSRROW  = 'CSRROW(1)'
RETCODE = RC
MESSAGE = 'MSG( )'
ZTDSELS = 0
ZTDTOP  = 0
LNR     = 1
address ISPEXEC 'TBCLOSE 'ALTAB
DO FOREVER
   address ISPEXEC 'TBOPEN 'ALTAB
   address ISPEXEC 'TBTOP  'ALTAB
   address ISPEXEC 'TBSKIP 'ALTAB' NUMBER('ZTDTOP')'
   address ispexec 'TBDISPL 'ALTAB' PANEL(PALTERTS)',
                   MESSAGE CURSOR 'CSRROW('LNR')' ,
                   'AUTOSEL(NO) POSITION(CRP)'
   If rc > 4 then do
      Say "*** Error on Display Alter RC="rc
      Say " ZERRSM =" ZERRSM
      Say " ZERRLM =" ZERRLM
      retuen
    End
   COMMAND = ZCMD

      /* PF Tasten Pruefen  */
   Select
      WHEN SUBSTR(COMMAND,1,3) = "CAN"  THEN DO
           address ispexec 'TBCLOSE 'ALTAB
           address ispexec 'TBERASE 'ALTAB
           Return
       end
      WHEN WORD(ZCMD,1) = "TRACE" then do
           IF WORD(ZCMD, 2) = "ON"     Then trace('R')
           IF WORD(ZCMD, 2) = "OFF" Then trace('O')
           UDBTRACE = word(ZCMD, 2)
           ADDRESS ISPEXEC 'VPUT (UDBTRACE) PROFILE'
           ZCMD = ''
       end
      When PF                  = 'PF03' THEN DO
           address ispexec 'TBCLOSE 'ALTAB
           address ispexec 'TBERASE 'ALTAB
           Return
       end
      When PF                  = 'PF04' THEN DO
           address ispexec 'TBCLOSE 'ALTAB
           address ispexec 'TBERASE 'ALTAB
           Return
       end
      Otherwise NOP
    End

   if ZTDSELS > 0 Then    LAUFNR = crp
   do cnt = 1 to  ZTDSELS            /* process ZeilenCommand */
      ADDRESS ISPEXEC 'TBMOD   'ALTAB
      address ispexec 'TBDISPL 'ALTAB' AUTOSEL(NO) POSITION(CRP)'
      If cnt = ZTDSELS Then Iterate
    end
   Address ispexec 'TBCLOSE 'ALTAB
   Leave
 End

address ispexec 'TBCLOSE 'ALTAB
address ispexec 'TBOPEN  'ALTAB
address ispexec 'TBTOP   'ALTAB

Do while RC = 0
   If NVal = '' Then do
      address ispexec 'TBSKIP   'ALTAB
      Iterate
    End
   If NVal <> Oval Then do
      JOB  = "N"
      STMT = "Y"
      PART = ""
      Select
        When Name = "LOGGED" Then Do
             If NVal = "NO"  Then Do
                NAME = "NOT LOGGED"
                NVal = ""
              End
             Else Do
                NAME = "LOGGED"
                NVal = ""
              End
         End
        When Name = "STOGROUP" Then Name = "USING STOGROUP  "
        Otherwise NOP
       End
      If Substr(Name, 1, 2) = "P " Then Do
         Part = "PART " Word(Name, 2)
         If Word(Name, 2)            = 0 Then Part = ""
         If Ausgabe.1.MAXPARTITIONS  > 0 THEN PART = ""
         Name = Word(Name, 3)
         Select
           When Name = "STOGROUP" Then Name = "USING STOGROUP  "
           Otherwise NOP
          End
       End

      SQLSTMT = "ALTER TABLESPACE  " Strip(DB2_CREATOR1) || '.' || ,
                                     Strip(DB2_NAME1) PART
      OK = Nexttab( SQLSTMT , al.)
      OK = Nexttab("      " NAME NVal ";", al.)
    End
   address ispexec 'TBSKIP   'ALTAB
 End

Return

Alter_Stogroup:


parse value CZeile with NAME                  '0a0d'x ,
                        CREATOR               '0a0d'x ,
                        VCATNAME              '0a0d'x ,
                        SPACE                 '0a0d'x ,
                        DATACLAS              '0a0d'x ,
                        MGMTCLAS              '0a0d'x ,
                        STORCLAS              '0a0d'x ,
                        .


NAME              = Left(NAME      ,   30, ' ')
VCATNAME          = Left(VCATNAME  ,    8, ' ')
DATACLAS          = Left(DATACLAS  ,   24, ' ')
MGMTCLAS          = Left(MGMTCLAS  ,   24, ' ')
STORCLAS          = Left(STORCLAS  ,   24, ' ')

area.0  = 9
area.1  = white"Alter Storagegroup "NAME
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"       "keyw"DATACLAS   "in1 || DATACLAS  || endin
area.7  = white"       "keyw"MGMTCLAS   "in1 || MGMTCLAS  || endin
area.8  = white"       "keyw"STORCLAS   "in1 || STORCLAS  || endin
area.9  = white" "

Call Anzeige_Dyn_Panel

If Strip(DATACLAS_Val) <> Strip(DATACLAS) Then Do
   OK = Nexttab( "Alter STOGROUP " Name  , al. )
   OK = Nexttab( "      DATACLAS      "DATACLAS_Val , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(MGMTCLAS_val)  <> Strip(MGMTCLAS)  Then Do
   OK = Nexttab( "Alter STOGROUP " Name  , al. )
   OK = Nexttab( "      MGMTCLAS      "MGMTCLAS_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(STORCLAS_Val)  <> Strip(STORCLAS) Then Do
   OK = Nexttab( "Alter STOGROUP " Name  , al. )
   OK = Nexttab( "      STORCLAS      "STORCLAS_Val, al.)
   OK = Nexttab( "; "                               , al. )
 End


Return

Alter_Database:

parse value CZeile with NAME                  '0a0d'x ,
                        CREATOR               '0a0d'x ,
                        STGROUP               '0a0d'x ,
                        BPOOL                 '0a0d'x ,
                        INDEXBP               '0a0d'x ,
                        DBID                  '0a0d'x ,
                        ROSHARE               '0a0d'x ,
                        TYPE                  '0a0d'x ,
                        .


DBName  = Left(NAME, 8, ' ')
STOGRP  = Left(STGROUP, 8, ' ')
BP      = Left(BPOOL,   8, ' ')
IBP     = Left(INDEXBP, 8, ' ')



area.0  = 9
area.1  = white"Alter Database "DBNAME
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"       "keyw"STOGROUP   "in1 || STOGRP || endin
area.7  = white"       "keyw"BPool      "in1 || BP     || endin
area.8  = white"       "keyw"BPool_IX   "in1 || IBP    || endin
area.9  = white" "

Call Anzeige_Dyn_Panel

If STOGROUP_Val <> STOGRP Then Do
   OK = Nexttab( "Alter Database " DBName  , al. )
   OK = Nexttab( "      STOGROUP      "STOGROUP_Val, al. )
 End

If Strip(BPool_Val)     <> Strip(BP)     Then Do
   OK = Nexttab( "Alter Database " DBName  , al. )
   OK = Nexttab( "      BUFFERPOOL    "BPool_Val, al. )
 End

If Strip(BPool_IX_Val)  <> Strip(IBP)    Then Do
   OK = Nexttab( "Alter Database " DBName  , al. )
   OK = Nexttab( "      INDEXBP       "BPool_IX_Val, al.)
 End


Return

Alter_Ppermission:
/*Noch ungetestet */


parse value CZeile with CONTROL_ID            '0a0d'x ,
                        SCHEMA                '0a0d'x ,
                        NAME                  '0a0d'x ,
                        TBSCHEMA              '0a0d'x ,
                        TBNAME                '0a0d'x ,
                        TBCORRELATION         '0a0d'x ,
                        COLNAME               '0a0d'x ,
                        COLNO                 '0a0d'x ,
                        CONTROL_TYPE          '0a0d'x ,
                        ENFORCED              '0a0d'x ,
                        IMPLICIT              '0a0d'x ,
                        ENABLE                '0a0d'x ,
                        .

Select
 When CONTROL_TYPE  = 'R' Then Do
      Alter_Type = "PERMISSION "
  End
 When CONTROL_TYPE  = 'M' Then Do
      Alter_Type = "MASK "
  End
 otherwise  NOP
 End

ENABLE  = " "
TBENAB  = " "


area.0  = 12
area.1  = white"Alter "Alter_Type"  " Space(SCHEMA '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"       "keyw"ENABLE   "in1 || ENABLE || endin" " ,
               "   E ENABLE    "
area.7  = white"                         D DISABLE        "
area.8  = white"                         R REGENERATE     "
area.9  = white" "
area.10 = white"       "keyw"TBCOLACC "in1 || TBENAB || endin" " ,
               "   A ACTIVATE  COLUMN ACCESS CONTROL"
area.11 = white"                         D DEACTIVATE     "
area.12 = white" "

Call Anzeige_Dyn_Panel

If ENABLE_Val <> ENABLE Then Do
   OK = Nexttab( "Alter "Alter_Type Space(Schema '.' Name, 0) , al. )
   Select
     When Translate(Substr(ENABLE_Val, 1)) = "E" then do
          OK = Nexttab( "      ENABLE      ;", al. )
      end
     When Translate(Substr(ENABLE_Val, 1)) = "D" then do
          OK = Nexttab( "      DISABLE     ;", al. )
      end
     When Translate(Substr(ENABLE_Val, 1)) = "R" then do
          OK = Nexttab( "      REGENERATE  ;", al. )
      end
     Otherwise Do
          OK = Nexttab( "      ENABLE      ;", al. )
      end
     End
 End

If TBCOLACC_Val <> TBENAB Then Do
   OK = Nexttab( "Alter TABLE "Space(TBSchema '.' TBName, 0) , al. )
   Select
     When Translate(Substr(TBCOLACC_Val, 1)) = "D" then do
          OK = Nexttab( "    DEACTIVATE ROW ACCESS CONTROL ;", al.)
      end
     Otherwise Do
          OK = Nexttab( "      ACTIVATE ROW ACCESS CONTROL ;", al.)
      end
     End
 End




Return

Alter_Routine:

parse value CZeile with SCHEMA                     '0a0d'x ,
                        NAME                       '0a0d'x ,
                        ROUTINETYPE                '0a0d'x ,
                        SPECIFICNAME               '0a0d'x ,
                        LANGUAGE                   '0a0d'x ,
                        ROUTINEID                  '0a0d'x ,
                        ORIGIN                     '0a0d'x ,
                        FUNCTION_TYPE              '0a0d'x ,
                        PARM_COUNT                 '0a0d'x ,
                        COLLID                     '0a0d'x ,
                        SQL_DATA_ACCESS            '0a0d'x ,
                        DBINFO                     '0a0d'x ,
                        WLM_ENVIRONMENT            '0a0d'x ,
                        WLM_ENV_FOR_NESTED         '0a0d'x ,
                        PROGRAM_TYPE               '0a0d'x ,
                        EXTERNAL_SECURITY          '0a0d'x ,
                        COMMIT_ON_RETURN           '0a0d'x ,
                        RESULT_SETS                '0a0d'x ,
                        LOBCOLUMNS                 '0a0d'x ,
                        EXTERNAL_NAME              '0a0d'x ,
                        PARAMETER_CCSID            '0a0d'x ,
                        VERSION                    '0a0d'x ,
                        ACTIVE                     '0a0d'x ,
                        DEBUG_MODE                 '0a0d'x ,
                        TEXT_ENVID                 '0a0d'x ,
                        RELCREATED                 '0a0d'x ,
                        SECURE                     '0a0d'x ,
                        SYSTEM_DEFINED             '0a0d'x ,
                        INLINE                     '0a0d'x ,
                        PACKAGEPATH                '0a0d'x ,
                        RUNOPTS                    '0a0d'x ,
                        .


select
  When  ROUTINETYPE = "P" Then Do
        select
          When  ORIGIN = "E"                              Then do
                Alter_Type  = "SQL EXTERNAL"
                Call Alter_Procedure_SQL_EXTERNAL
           End
          When  ORIGIN = "N"                              Then do
                Alter_Type  = "SQL NATIVE  "
                Call Alter_Procedure_SQL_NATIVE
           End
           Otherwise Do
                Alter_Type  = "EXTERNAL    "
                Call Alter_Procedure_EXTERNAL
           End
         End
   End
  When  ROUTINETYPE = "F" Then Do
        select
          When  ORIGIN = "E"                            Then do
                Alter_Type  = "EXTERNAL    "
                Call Alter_Function_EXTERNAL
           End
          When  FUNCTION_TYPE = "T"                     Then do
                Alter_Type  = "SQL TABLE   "
                Call Alter_Function_SQL_Table
           End
          When  ORIGIN = "U"                            Then do
                Alter_Type  = "COMPILED SQL SCALAR "
                Call Alter_Function_Compiled_SQL_Scalar
           End
          When  ORIGIN = "Q" & FUNCTION_TYPE = "S"      Then do
                Alter_Type  = "INLINED SQL SCALAR  "
                Call Alter_Function_Inlined_SQL_Scalar
           End
          Otherwise NOP
         End
   End
    Otherwise NOP
 End

Return

Alter_Procedure_EXTERNAL:

WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Procedure "Space(Schema '.' NAME  , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return



Alter_Procedure_SQL_EXTERNAL:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' SPECIFICNAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Procedure "Space(Schema '.' NAME  , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return

Alter_Procedure_SQL_NATIVE:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Procedure "Space(Schema '.' NAME  , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return


Alter_Function_EXTERNAL:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' SPECIFICNAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Specific Function ",
                 Space(Schema '.' SPECIFICNAME,0), al.)
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return

Alter_Function_SQL_Table:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Function "Space(Schema '.' NAME   , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return

Alter_Function_Compiled_SQL_Scalar:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Function "Space(Schema '.' NAME   , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return

Alter_Function_Inlined_SQL_Scalar:



WLMENV            = Left(WLM_ENVIRONMENT,  50, ' ')

area.0  = 10
area.1  = white"Alter "Alter_Type"  " Space(Schema '.' NAME, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw"WLM_ENVIRONMENT "in1 || WLMENV || endin
area.6  = white"   "
area.7  = white"   "
area.8  = white"   "
area.9  = white"   "
area.10 = white"   "


Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If WLM_ENVIRONMENT_Val <> WLMENV   Then do
   OK = Nexttab( "Alter Function "Space(Schema '.' NAME   , 0) , al. )
   OK = Nexttab( "      WLM ENVIRONMENT " WLM_ENVIRONMENT_Val, al.)
   OK = Nexttab( " ;                        ", al.)
 End

Return

Alter_Column:

parse value CZeile with TBCREATOR             '0a0d'x ,
                        TBNAME                '0a0d'x ,
                        COLNO                 '0a0d'x ,
                        NAME                  '0a0d'x ,
                        COLTYPE               '0a0d'x ,
                        LENGTH                '0a0d'x ,
                        SCALE                 '0a0d'x ,
                        LENGTH2               '0a0d'x ,
                        NULLS                 '0a0d'x ,
                        DEFAULT               '0a0d'x ,
                        HIDDEN                '0a0d'x ,
                        COLCARD               '0a0d'x ,
                        KEYSEQ                '0a0d'x ,
                        PARTKEY_COLSEQ        '0a0d'x ,
                        PARTKEY_ORDERING      '0a0d'x ,
                        GENERATED_ATTR        '0a0d'x ,
                        .


GENERATED         = " "
GENERATED_Val     = " "
DROPDEF           = Left(' '         ,  1, ' ')
SETDEF            = Left(' '         ,  1, ' ')
SETDEFVAL         = Left(' '         , 40, ' ')
DROPColumn        = "N"
NewName           = Left(' '         , 50, ' ')
Coltype           = Left(Coltype     , 15, ' ')
Colstr            = Alter_coltypes(COLTYPE)
LOBILEN           = -1

select
    When  COLTYPE  = "CLOB"    Then Do
          ColLength = LENGTH2
          LOBILEN     = 0
          IF LENGTH   > 4 Then Do
             LOBILEN  = LENGTH  - 4
           end
     End
    When  COLTYPE  = "BLOB"    Then Do
          ColLength = LENGTH2
          LOBILEN     = 0
          IF LENGTH   > 4 Then Do
             LOBILEN  = LENGTH  - 4
           end
     End
    When  COLTYPE  = "DBCLOB"  Then Do
          ColLength = LENGTH2
          LOBILEN     = 0
          IF LENGTH   > 4 Then Do
             LOBILEN  = (LENGTH  - 4) / 2
           end
     End
    When  COLTYPE  = "DECIMAL" Then ColLength = LENGTH","Scale
    When  COLTYPE  = "CHAR"    Then ColLength = LENGTH
    When  COLTYPE  = "VARCHAR" Then ColLength = LENGTH
    Otherwise                       ColLength = ""
 End

if length(ColLength) > 0 then ColLength = left(ColLength, 11, ' ')


area.0  = 15
area.1  = white"Alter "Alter_Type"  " Space(TBCreator '.' TBNAME, 0) ,
               "Column : " Strip(Name)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"    GENERATED         A=ALWAYS D=DEFAULT"
area.7  = white"   "keyw"RenameColumn  "in1 || NewName  || endin
area.8  = white"   "keyw"ColType       "in1 ||ColType|| endin || Colstr
area.9  = white"   "keyw"ColLength     "in1 ||ColLength|| endin
If LOBILEN > -1 Then do
   If LOBILEN = 0 THEN LOBILEN = "     "
   LOBILEN = Left(LOBILEN, 5, ' ')
   area.10 = white"   "keyw"INLINELEN     "in1 ||LOBILEN|| endin
 End
 Else Do
   area.10 = white"   "keyw"INLENELEN     "IN1 || "" || endin
 End
area.11 = white"   "keyw"Drop_Default  "in1 ||DROPDEF  || endin || ,
               " Y=DROP DEFAULT DEFAULT VALUE = "DEFAULT
area.12 = white"   "keyw"SET_Default   "in1 ||SETDEF   || endin || ,
               " Y=SET "keyw"Value" in1||SETDEFVAL|| endin
area.13 = white"   "
area.14 = white"   "keyw"Drop          "in1 ||DROPColumn|| endin || ,
               " Y=DROP Column  "
area.15 = white"   "

If GENERATED_ATTR = "A" ,
 | GENERATED_ATTR = "D" Then Do
   area.6  = white"   "keyw"GENERATED     "In1 ||GENERATED_ATTR || ,
             endin"  A=ALWAYS D=DEFAULT "
 End

Call Anzeige_Dyn_Panel

OK = Nexttab( "--     ", al.)
If GENERATED_Val <> GENERATED_ATTR ,
 & GENERATED_Val <> " "            Then Do
   OK = Nexttab( "Alter Table "Space(TBCreator '.' TBNAME, 0) , al. )
   Select
     When GENERATED_Val = "D"               Then do
          OK = Nexttab( "      ALTER COLUMN "NAME || ,
                        " SET GENERATED BY DEFAULT ", al.)
          OK = Nexttab( " ;                        ", al.)
      end
     When GENERATED_Val = "A"               Then do
          OK = Nexttab( "      ALTER COLUMN "NAME || ,
                        " SET GENERATED ALWAYS     ", al.)
          OK = Nexttab( " ;                        ", al.)
      end
     Otherwise Do
          OK = Nexttab( " --   ALTER COLUMN "NAME || ,
                        " SET GENERATED BY DEFAULT ", al.)
          OK = Nexttab( " --   ALTER COLUMN "NAME || ,
                        " SET GENERATED ALWAYS     ", al.)
          OK = Nexttab( " ;                        ", al.)
      end
     End
 End

If Strip(RenameColumn_val)<> Name     ,
 & Strip(RenameColumn_val)<> ""       Then Do
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      RENAME COLUMN "Strip(Name)          , al.)
   OK = Nexttab( "       TO      " Strip(RenameColumn_val)    , al.)
   OK = Nexttab( "; "                               , al. )
 End

If Strip(Drop_val) = "Y" Then do
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      DROP COLUMN "Strip(Name)" RESTRICT",  al.)
   OK = Nexttab( "; "                               , al. )
 End

ColType_val = Strip(ColType_val)
If ColLength_val = "COLLENGTH_VAL" Then ColLength_val = ColLength
If (Strip(ColType_val)<> Coltype & Pos(ColType_val, Colstr ) > 0 ) ,
 | ColLength_val <> ColLength Then Do
   Select
    when ColType_val = "VARCHAR" Then Len = "(" || ColLength_val || ")"
    when ColType_val = "CHAR"    Then Len = "(" || ColLength_Val || ")"
    when ColType_val = "DECIMAL" Then Len = "(" || ColLength_Val || ")"
    when ColType_val = "BLOB"    Then Len = "(" || ColLength_Val || ")"
    when ColType_val = "CLOB"    Then Len = "(" || ColLength_Val || ")"
    otherwise                         Len = ""
   End
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      Alter  COLUMN "Strip(Name)       , al.)
   OK = Nexttab( "      SET DATA TYPE " ColType_val || len , al.)
   OK = Nexttab( "; "                               , al. )
 End

If Drop_Default_Val = "Y" Then do
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      Alter  COLUMN "Strip(Name)       , al.)
   OK = Nexttab( "         DROP DEFAULT "                , al.)
   OK = Nexttab( "; "                               , al. )
 End

If SET_Default_Val = "Y"       Then Do
    If Value_val <> SETDEFVAL Then DEFVAL = Strip(Value_val, 'T')
     ELSE DEFVAL = ""
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      Alter  COLUMN "Strip(Name)       , al.)
   OK = Nexttab( "         SET  DEFAULT "DEFVAL          , al.)
   OK = Nexttab( "; "                               , al. )
 End

IF Datatype(INLINELEN_VAL) = "NUM" ,
 & INLINELEN <> LOBILEN Then Do
   OK = Nexttab( "Alter TABLE   " Space(TBCreator "." TBname, 0), al.)
   OK = Nexttab( "      Alter  COLUMN "Strip(Name)       , al.)
   OK = Nexttab( "         SET INLINE LENGTH "INLINELEN_VAL ,  al.)
   OK = Nexttab( "; "                               , al. )
 End

Return

Alter_coltypes:
AT.0    = 15
AT.1    = "SMALLINT"
AT.1.1  = "INTEGER BIGINT DECIMAL REAL DOUBLE DECFLOAT"
AT.2    = "INTEGER"
AT.2.1  = "BIGINT DECIMAL DOUBLE DECFLOAT"
AT.3    = "BIGINT"
AT.3.1  = "DECFLOAT"
AT.4    = "DECIMAL"
AT.4.1  = "SMALLINT INTEGER BIGINT REAL DOUBLE DECFLOAT"
AT.5    = "DECFLOAT"
AT.5.1  = "DECFLOAT"
AT.6    = "FLOAT"
AT.6.1  = "REAL DOUBLE DECFLOAT"
AT.7    = "CHAR"
AT.7.1  = "VARCHAR"
AT.8    = "VARCHAR"
AT.8.1  = "CHAR"
AT.9    = "LONG VARCHAR BINARY VARBINARY"
AT.9.1  = "VARCHAR"
AT.10   = "LONG VARCHAR BINARY VARBINARY"
AT.10.1 = "VARCHAR"
AT.11   = "GRAPHIC"
AT.11.1 = "VARGRAPHIC"
AT.12   = "VARGRAPHIC"
AT.12.1 = "GRAPHIC"
AT.13   = "LONG VARGRAPHIC"
AT.13.1 = "VARGRAPHIC"
AT.14   = "BINARY"
AT.14.1 = "VARBINARY"
AT.15   = "VARBINARY"
AT.15.1 = "BINARY"

do ati = 1 to at.0
 If at.ati = Arg(1) Then return AT.ati.1
 End
return ""

Alter_Sequence:

parse value CZeile with SCHEMA                '0a0d'x ,
                        NAME                  '0a0d'x ,
                        SEQTYPE               '0a0d'x ,
                        DCREATOR              '0a0d'x ,
                        DNAME                 '0a0d'x ,
                        DCOLNAME              '0a0d'x ,
                        SEQUENCEID            '0a0d'x ,
                        INCREMENT             '0a0d'x ,
                        START                 '0a0d'x ,
                        MAXVALUE              '0a0d'x ,
                        MINVALUE              '0a0d'x ,
                        MAXASSIGNEDVAL        '0a0d'x ,
                        CYCLE                 '0a0d'x ,
                        CACHE                 '0a0d'x ,
                        ORDER                 '0a0d'x ,
                        DATATYPEID            '0a0d'x ,
                        SOURCETYPEID          '0a0d'x ,
                        PRECISION             '0a0d'x ,
                        RESTARTWITH           '0a0d'x ,
                        SEQSCHEMA             '0a0d'x ,
                        SEQNAME               '0a0d'x ,
                        CREATEDTS             '0a0d'x ,
                        ALTEREDTS             '0a0d'x ,
                        REMARKS               "0a0d"x     ,
                        .


REMARKS             = Left(REMARKS              ,300, ' ')
RESTARTWITH         = Left(RESTARTWITH          , 19, ' ')
INCREMENT           = Left(INCREMENT            , 19, ' ')
START               = Left(START                , 19, ' ')
MAXVALUE            = Left(MAXVALUE             , 19, ' ')
MINVALUE            = Left(MINVALUE             , 19, ' ')
MAXASSIGNEDVAL      = Left(MAXASSIGNEDVAL       , 19, ' ')
CYCLE               = Left(CYCLE                , 19, ' ')
CACHE               = Left(CACHE                , 19, ' ')
ORDER               = Left(ORDER                , 19, ' ')

area.0 = 20
area.1  = white"Alter Sequence "Space(Schema '.' Name, 0) ,
               " ID="SEQUENCEID "Type="SEQTYPE
area.2  = white"                                               "
area.3  = white"                                               "
area.4  = white"                                               "
area.5  = white"                                               "
area.6  = white"     "keyw"RESTARTWITH   "in1 || RESTARTWITH   || endin
area.7  = white"     "keyw"INCREMENT     "in1 || INCREMENT     || endin
area.8  = white"     "keyw"START         "in1 || START         || endin
area.9  = white"     "keyw"MAXVALUE      "in1 || MAXVALUE      || endin
area.10 = white"     "keyw"MINVALUE      "in1 || MINVALUE      || endin
area.11 = white"     "keyw"CYCLE         "in1 || CYCLE         || endin
area.12 = white"     "keyw"CACHE         "in1 || CACHE         || endin
area.13 = white"     "keyw"ORDER         "in1 || ORDER         || endin
area.14 = white"      MAXASSIGNEDVAL"white||MAXASSIGNEDVAL
area.15 = white" "
area.16 = white"     "keyw"Remarks       "in1 || Remarks
area.17 = " "
area.18 = " "
area.19 = " "endin
area.20 = white" "

Call Anzeige_Dyn_Panel

If SEQTYPE = "S" Then Call Build_Alter_Sequence
Else                  Call Build_Alter_Identity

Return

Build_Alter_Sequence:

If Restartwith_Val <> RESTARTWITH Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If RESTARTWITH_Val = "" Then Do
      OK = Nexttab( "      Restart    ; "                 , al.)
    End
   Else do
      OK = Nexttab( "      Restart WITH " RESTARTWITH_Val " ;" , al.)
    End
 End

If INCREMENT_Val <> INCREMENT   Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   OK = Nexttab( "      INCREMENT BY " INCREMENT_Val " ;"    , al. )
 End

If MINVALUE_Val <> MINVALUE    Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If MINVALUE_Val = "" Then Do
      OK = Nexttab( "   NO MINVALUE  "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      MINVALUE  " MINVALUE_Val " ;"    , al. )
    End
 End

If MAXVALUE_Val <> MAXVALUE    Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If MAXVALUE_Val = "" Then Do
      OK = Nexttab( "      MAXVALUE  "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      MAXVALUE  " MAXVALUE_Val " ;"    , al. )
    End
 End

If CACHE_Val <> CACHE       Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If CACHE_Val    = "" ,
    | CACHE_Val    = 0  ,
    | SUBSTR(STRIP(CACHE_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO CACHE     "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      CACHE     " CACHE_Val " ;"    , al. )
    End
 End

If CYCLE_Val <> CYCLE    Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If SUBSTR(STRIP(CYCLE_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO CYCLE   "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      CYCLE   "              " ;"    , al. )
    End
 End


If ORDER_Val <> ORDER    Then Do
   OK = Nexttab( "Alter Sequence " Space(Schema '.' Name, 0) , al. )
   If SUBSTR(STRIP(ORDER_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO ORDER   "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      ORDER   "              " ;"    , al. )
    End
 End

If Remarks_VAL <> Remarks  Then Do
   SEQName = Space(Schema '.' Name, 0)
   OK = Nexttab( "COMMENT ON Sequence "SEQName" IS ", al. )
   OK = Nexttab( "'" || Strip(Remarks_VAL, 'T') || "'"    , al. )
   OK = Nexttab( ";"                  , al. )
 End


Return

Build_Alter_Identity:

If Restartwith_Val <> RESTARTWITH Then Do
   RESTARTWITH_Val = Strip(RESTARTWITH_Val)
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME, 0)    , al. )
   OK = Nexttab( "      Restart WITH " RESTARTWITH_Val " ;" , al.)
 End

If INCREMENT_Val <> INCREMENT   Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME, 0)    , al. )
   OK = Nexttab( "      INCREMENT BY " INCREMENT_Val " ;"    , al. )
 End

If MINVALUE_Val <> MINVALUE    Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME, 0)    , al. )
   If MINVALUE_Val = "" Then Do
      OK = Nexttab( "   NO MINVALUE  "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      MINVALUE  " MINVALUE_Val " ;"    , al. )
    End
 End

If MAXVALUE_Val <> MAXVALUE    Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME, 0)    , al. )
   If MAXVALUE_Val = "" Then Do
      OK = Nexttab( "      MAXVALUE  "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      MAXVALUE  " MAXVALUE_Val " ;"    , al. )
    End
 End

If CACHE_Val <> CACHE       Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME "SET", 0) , al. )
   If CACHE_Val    = "" ,
    | CACHE_Val    = 0  ,
    | SUBSTR(STRIP(CACHE_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO CACHE     "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      CACHE     " CACHE_Val " ;"    , al. )
    End
 End

If CYCLE_Val <> CYCLE    Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME "SET", 0) , al. )
   If SUBSTR(STRIP(CYCLE_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO CYCLE   "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      CYCLE   "              " ;"    , al. )
    End
 End


If ORDER_Val <> ORDER    Then Do
   OK = Nexttab( "Alter Table " Space(DCreator'.' DName, 0) , al. )
   OK = Nexttab( "      Alter Column "Space(DCOLNAME, 0)    , al. )
   If SUBSTR(STRIP(ORDER_Val), 1, 1)    = "N" Then Do
      OK = Nexttab( "   NO ORDER   "              " ;"    , al. )
    End
   Else Do
      OK = Nexttab( "      ORDER   "              " ;"    , al. )
    End
 End



Return

Alter_Trigger:

parse value CZeile with SCHEMA                '0a0d'x ,
                        TBNAME                '0a0d'x ,
                        TBOWNER               '0a0d'x ,
                        TRIGTIME              '0a0d'x ,
                        TRIGEVENT             '0a0d'x ,
                        TRIGNAME              '0a0d'x ,
                        GRANULARITY           '0a0d'x ,
                        SECURE                '0a0d'x ,
                        SQLPL                 '0a0d'x ,
                        DEBUG_MODE            '0a0d'x ,
                        OWNER                 '0a0d'x ,
                        CREATEDBY             '0a0d'x ,
                        ASUTIME               '0a0d'x ,
                        WLM_ENVIRONMENT       '0a0d'x ,
                        CREATEDTS             '0a0d'x ,
                        ALTEREDTS             '0a0d'x ,
                        REMARKS               '0a0d'x     ,
                        .


SECURE            = Left(SECURE ,    1, ' ')


area.0  = 7
area.1  = white"Alter Trigger  "Space(Schema "." name, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"       "keyw"SECURED    "in1 || SECURE    || endin ,
          white"  Y/N  "
area.7  = white" "

Call Anzeige_Dyn_Panel

If Strip(SECURED_Val) <> Strip(SECURE) Then Do
   If SECURED = "N" Then NOT = "NOT "
   Else                  NOT = "    "
   OK = Nexttab( "Alter Trigger  " Space(Schema "." name, 0), al.)
   OK = Nexttab( "      "NOT"SECURED       "  , al. )
   OK = Nexttab( "; "                               , al. )
 End


Return

Alter_View:

parse value CZeile with Creator               '0a0d'x ,
                        Name                  '0a0d'x ,
                        TBCreator             '0a0d'x ,
                        TBName                '0a0d'x ,
                        .


REGENERATE        = " "
REGENERATE        = Left(REGENERATE, 1, ' ')


area.0  = 7
area.1  = white"Alter View  "Space(Creator "." name, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"                                             "
area.6  = white"       "keyw"REGENERATE "in1 || REGENERATE || endin ,
          white"  R    "
area.7  = white" "

Call Anzeige_Dyn_Panel

If Strip(REGENERATE_Val) = 'R'            Then Do
   OK = Nexttab( "Alter View     " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      REGENERATE         "  , al. )
   OK = Nexttab( "; "                               , al. )
 End


Return


Alter_BUFFERPOOL:

parse value CZeile with ROWNUM                '0a0d'x ,
                        BPNAME                '0a0d'x ,
                        VPSIZE                '0a0d'x ,
                        VPSEQT                '0a0d'x ,
                        VPPSEQT               '0a0d'x ,
                        VPXPSEQT              '0a0d'x ,
                        DWQT                  '0a0d'x ,
                        PCT_VDWQT             '0a0d'x ,
                        ABS_VDWQT             '0a0d'x ,
                        PGSTEAL               '0a0d'x ,
                        ID                    '0a0d'x ,
                        USE_COUNT             '0a0d'x ,
                        PGFIX                 '0a0d'x ,
                        AUTOSIZE              '0a0d'x ,
                        FRAMESIZE             '0a0d'x ,
                        ALLOC_FRAME4K         '0a0d'x ,
                        ALLOC_FRAME1M         '0a0d'x ,
                        VPSIZEMIN             '0a0d'x ,
                        VPSIZEMAX             '0a0d'x ,
                        .


BP                = Left(BPNAME        ,  7, ' ')
VPSIZE            = Left(VPSIZE        , 10, ' ')
VPSEQT            = Left(VPSEQT        ,  3, ' ')
VPPSEQT           = Left(VPPSEQT       ,  3, ' ')
VPXPSEQT          = Left(VPXPSEQT      ,  7, ' ')
DWQT              = Left(DWQT          ,  3, ' ')
PCT_VDWQT         = Left(PCT_VDWQT     ,  5, ' ')
ABS_VDWQT         = Left(ABS_VDWQT     ,  5, ' ')
PGSTEAL           = Left(PGSTEAL       ,  7, ' ')
PGFIX             = Left(PGFIX         ,  3, ' ')
AUTOSIZE          = Left(AUTOSIZE      ,  3, ' ')
FRAMESIZE         = Left(FRAMESIZE     ,  7, ' ')
ALLOC_FRAME4K     = Left(ALLOC_FRAME4K ,  7, ' ')
ALLOC_FRAME1M     = Left(ALLOC_FRAME1M ,  7, ' ')
VPSIZEMIN         = Left(VPSIZEMIN     ,  9, ' ')
VPSIZEMAX         = Left(VPSIZEMAX     ,  9, ' ')


area.0  = 20
area.1  = white"Alter Bufferpool  "Space(BP, 0)
area.2  = white" "
area.3  = white" "
area.4  = white" "
area.5  = white" "
area.6  = white" "keyw"VPSIZE    "in1 || VPSIZE     || endin
area.7  = white" "keyw"VPSEQT    "in1 || VPSEQT     || endin
area.8  = white" "keyw"VPPSEQT   "in1 || VPPSEQT    || endin
area.9  = white" "keyw"VPXPSEQT  "in1 || VPXPSEQT   || endin
area.10 = white" "keyw"DWQT      "in1 || DWQT       || endin
area.11 = white" "keyw"PCT_VDWQT "in1 || PCT_VDWQT  || endin
area.12 = white" "keyw"ABS_VDWQT "in1 || ABS_VDWQT  || endin
area.13 = white" "keyw"PGSTEAL   "in1 || PGSTEAL    || endin ,
          white"LRU/FIFO/NONE  "
area.14 = white" "keyw"PGFIX     "in1 || PGFIX      || endin ,
          white"    YES/NO "
area.15 = white" "keyw"FRAMESIZE "in1 || FRAMESIZE  || endin ,
          white"4K/1M/2G       "
area.16 = white" "keyw"AUTOSIZE  "in1 || AUTOSIZE   || endin ,
          white"    YES/NO "  ||     ,
          keyw"VPSIZEMIN  "in1 || VPSIZEMIN  || endin " " || ,
          keyw"VPSIZEMAX  "in1 || VPSIZEMAX  || endin ,
          white" "
area.17 = white" "
area.18 = white" "
area.19 = white" "
area.20 = white" "

Call Anzeige_Dyn_Panel

If Strip(VPSIZE_VAL    ) <> VPSIZE        Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPSIZE("VPSIZE_Val")" , al. )
 End

If Strip(VPSEQT_Val) <> VPSEQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPSEQT("VPSEQT_Val")" , al. )
 End

 If Strip(VPPSEQT_Val) <> VPPSEQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPPSEQT("VPPSEQT_Val")" , al. )
 End

If Strip(VPXPSEQT_Val) <> VPXPSEQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPXPSEQT("VPXPSEQT_Val")" , al. )
 End

If Strip(VPXPSEQT_Val) <> VPXPSEQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPXPSEQT("VPXPSEQT_Val")" , al. )
 End

If Strip(DWQT_Val) <> DWQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  DWQT("DWQT_Val")" , al. )
 End

If Strip(PCT_VDWQT_Val) <> PCT_VDWQT  ,
 | Strip(ABS_VDWQT_Val) <> ABS_VDWQT       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VDWQT ("PCT_VDWQT_Val","ABS_VDWQT_Val")" , al. )
 End


If Strip(PGSTEAL_Val) <> PGSTEAL       Then Do
   select
     When Substr(PGSTEAL_Val, 1, 1) = "L"   Then PGSTEAL_Val = "LRU"
     When Substr(PGSTEAL_Val, 1, 1) = "F"   Then PGSTEAL_Val = "FIFO"
     Otherwise                                   PGSTEAL_Val = "NONE"
    End
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  PGSTEAL("PGSTEAL_Val")" , al. )
 End

If Strip(PGFIX_Val) <> PGFIX       Then Do
   If Substr(PGFIX_Val, 1, 1) = "N" Then  PGFIX_Val = "NO"
    Else                                 PGFIX_Val = "YES"
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  PGFIX("PGFIX_Val")" , al. )
 End

If Strip(AUTOSIZE_Val) <> AUTOSIZE       Then Do
   If Substr(AUTOSIZE_Val, 1, 1) = "N" Then AUTOSIZE_Val = "NO"
   Else                                    AUTOSIZE_Val = "YES"
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  AUTOSIZE("AUTOSIZE_Val")" , al. )
 End

If Strip(FRAMESIZE_Val) <> FRAMESIZE       Then Do
   select
     When FRAMESIZE_Val             = "2G"  Then PGSTEAL_Val = "2G"
     When FRAMESIZE_Val             = "1M"  Then PGSTEAL_Val = "1M"
     Otherwise                                   PGSTEAL_Val = "4K"
    End
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  FRAMESIZE ("FRAMESIZE_Val")" , al. )
 End


If Strip(VPSIZEMIN_Val) <> VPSIZEMIN       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPSIZEMIN("VPSIZEMIN_Val ")", al. )
 End

If Strip(VPSIZEMAX_Val) <> VPSIZEMAX       Then Do
   OK = Nexttab( "-Alter Bufferpool ("Space(BP, 0) ")" ,
                 "  VPSIZEMAX("VPSIZEMAX_Val ")", al. )
 End

Return

Alter_Index:
/* Wird noch auf Partition und Columns erweitert */
   Call Alter_Index_Base
return

Alter_Index_Base:


parse value CZeile with Creator               '0a0d'x ,
                        NAME                  '0a0d'x ,
                        TBCREATOR             '0a0d'x ,
                        TBNAME                '0a0d'x ,
                        BPOOL                 '0a0d'x ,
                        DBNAME                '0a0d'x ,
                        INDEXSPACE            '0a0d'x ,
                        HASH                  '0a0d'x ,
                        CLUSTERING            '0a0d'x ,
                        CLUSTERED             '0a0d'x ,
                        UNIQUERULE            '0a0d'x ,
                        FULLKEYCARD           '0a0d'x ,
                        CLOSERULE             '0a0d'x ,
                        COPY                  '0a0d'x ,
                        PIECESIZE             '0a0d'x ,
                        PADDED                '0a0d'x ,
                        COMPRESS              '0a0d'x ,
                        INDEXTYPE             '0a0d'x ,
                        SPARSE                '0a0d'x ,
                        VERSION               '0a0d'x ,
                        CLUSTERRATIOF         '0a0d'x ,
                        FIRSTKEYCARDF         '0a0d'x ,
                        FULLKEYCARDF          '0a0d'x ,
                        NLEAF                 '0a0d'x ,
                        NLEVELS               '0a0d'x ,
                        IX_EXTENSION_TYPE     '0a0d'x ,
                        IX_EXTENSION_TYPE2    '0a0d'x ,
                        KEYTARGET_COUNT       '0a0d'x ,
                        UNIQUE_COUNT          '0a0d'x ,
                        REMARKS               '0a0d'x     ,
                        .


AUSWKZ   = "IP"
tabnr     = tabnr     + 1
object    = Space(CREATOR '.' NAME, 0)
call Lesen_daten
CZeile  = ""
COLTAB = "COLTB"tabnr
address ispexec 'TBOPEN  'COLTAB
address ispexec 'TBTOP   'COLTAB
address ispexec 'TBSKIP  'COLTAB
address ispexec 'TBGET   'COLTAB
tabnr     = tabnr     - 1
AUSWKZ   = "IX"
parse value CZeile with Part                  '0a0d'x ,
                        ixname                '0a0d'x ,
                        ixCREATOR             '0a0d'x ,
                        cardf                 '0a0d'x ,
                        spacef                '0a0d'x ,
                        extends               '0a0d'x ,
                        storname              '0a0d'x ,
                        vcatname              '0a0d'x ,
                        ixdbname              '0a0d'x ,
                        ixindexspace          '0a0d'x ,
                        vsamds                '0a0d'x ,
                        pqty                  '0a0d'x ,
                        sqty                  '0a0d'x ,
                        FREEPAGE              '0a0d'x ,
                        PCTFREE               '0a0d'x ,
                        .

BPOOL             = Left(BPOOL       ,  8, ' ')
CLOSE             = Left(CLOSERULE   ,  1, ' ')
COPY              = Left(COPY        ,  1, ' ')
HASH              = Left(HASH        ,  1, ' ')
PIECESIZE         = Left(PIECESIZE   , 10, ' ')
CLUSTER           = Left(CLUSTERING , 1, ' ')
PADDED            = Left(PADDED      ,  1, ' ')
COMPRESS          = Left(COMPRESS    ,  1, ' ')
ADDCOL            = Left(' '         ,  1, ' ')
INCCOL            = Left(' '         ,  1, ' ')
NewName           = Left(' '         , 50, ' ')
PQTY              = Right(PQTY       , 10, ' ')
SQTY              = Right(SQTY       , 10, ' ')
REGENERATE        = " "


Index_Name = Space(Creator "." name, 0)
area.0  = 23
area.1  = white"Alter Index "Index_Name
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"   "keyw"REGENERATE "in1 || REGENERATE || endin ,
          white"       R   "
area.5  = white"                                             "
area.6  = white"   "keyw"BUFFERPOOL "in1 || BPOOL      || endin
area.7  = white"   "keyw"CLOSE      "in1 || CLOSE      || endin ,
          white"       Y/N "
area.8  = white"   "keyw"COPY       "in1 || COPY       || endin ,
          white"       Y/N "
area.9  = white"   "keyw"CLUSTER    "in1 || CLUSTER    || endin ,
          white"       Y/N "
area.10 = white"   "keyw"PADDED     "in1 || PADDED     || endin ,
          white"       Y/N "
area.11 = white"   "keyw"COMPRESS   "in1 || COMPRESS   || endin ,
          white"       Y/N "
area.12 = white"   "keyw"PIECESIZE  "in1 || PIECESIZE  || endin
area.13 = white"   "keyw"PQTY       "in1 || PQTY       || endin
area.14 = white"   "keyw"SQTY       "in1 || SQTY       || endin
area.15 = white"   "keyw"FREEPAGE   "in1 || FREEPAGE   || endin
area.16 = white"   "keyw"PCTFREE    "in1 || PCTFREE    || endin
area.17 = white" "
area.18 = white"   "keyw"ADD Column "in1 || ADDCOL     || endin
area.19 = white"   "keyw"Include    "in1 || INCCOL     || endin
area.20 = white" "
area.21 = white"   "keyw"RenameIndex :"in1 || NewName  || endin
area.22 = white" "
area.23 = white" "

Call Anzeige_Dyn_Panel

If Strip(BUFFERPOOL_Val) <> Strip(BPOOL)     Then Do
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      BUFFERPOOL  "BUFFERPOOL_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(COPY_Val) <> COPY           Then Do
   If Substr(COPY_VAL  , 1, 1) = "N" Then copy = 'NO'
   Else                                   copy = 'YES'
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      COPY        "COPY     , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(CLOSE_Val) <> CLOSE       Then Do
   If Substr(CLOSE_Val,1, 1) = "N" Then CLOSE    = 'NO'
   Else                                 CLOSE    = 'YES'
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      CLOSE       "CLOSE  , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(CLUSTER_Val) <> CLUSTER Then Do
   If Substr(CLUSTER_Val,1, 1) = "N" Then CLUSTER = 'NOT'
   Else                                   CLUSTER = ''
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "     "CLUSTER || " CLUSTER " , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(PADDED_Val) <> PADDED      Then Do
   If Substr(PADDED_Val,1, 1) = "N"  Then PADDED   = 'NOT'
   Else                                   PADDED   = '   '
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "     "PADDED" PADDED      " , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(COMPRESS_Val) <> COMPRESS    Then Do
   If Substr(COMPRESS_Val,1, 1) = "N" Then COMPRESS = 'NO'
   Else                                    COMPRESS = 'YES'
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      COMPRESS    "COMPRESS , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(PIECESIZE_Val)<> PIECESIZE   Then Do
   If Datatype(PIECESIZE_Val) /= "NUM" Then PIECESIZE_Val = 0
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      PIECESIZE   "PIECESIZE_VAL, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(PQTY_Val)     <> PQTY        Then Do
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      PRIQTY      "PQTY_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(SQTY_Val)     <> SQTY        Then Do
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      SECQTY      "SQTY_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(FREEPAGE_Val) <> FREEPAGE    Then Do
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      FREEPAGE    "FREEPAGE_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(PCTFREE_Val)  <> PCTFREE     Then Do
   OK = Nexttab( "Alter Index    " Index_Name, al.)
   OK = Nexttab( "      PCTFREE     "PCTFREE_Val, al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(ADD_Val)<> ADDCOL      Then Do
   ix_Function = "Add Column"
   tabnr     = tabnr     + 1
   AUSWKZ   = "CO"
   Call Alter_Index_Add_Column
   tabnr     = tabnr     - 1
   AUSWKZ   = "IX"
 End

If Strip(Include_Val)<> INCCOL      Then Do
   ix_Function = "ADD Include Column"
   AUSWKZ   = "CO"
   tabnr     = tabnr     + 1
   Call Alter_Index_Add_Column
   tabnr     = tabnr     - 1
   AUSWKZ   = "IX"
 End

If Strip(RenameIndex_val)<> NewName     Then Do
   OK = Nexttab( "RENAME INDEX   " Space(Creator "." name, 0), al.)
   OK = Nexttab( "       TO      " Strip(RenameIndex_val)    , al.)
   OK = Nexttab( "; "                               , al. )
 End

If Strip(REGENERATE_Val) = 'R'            Then Do
   OK = Nexttab( "Alter Index    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      REGENERATE         "  , al. )
   OK = Nexttab( "; "                               , al. )
 End

Return

Call_Sored_Procedure:

Parse Value Object1 With PROC_CREATOR '.' PROC_NAME .

SQLSTMT = "SELECT    DISTINCT                            ",
          "        P.SCHEMA       AS ROUTINENAME         ",
          "     ,  P.NAME         AS ROUTINESCHEMA       ",
          "     ,  P.SPECIFICNAME AS SPECIFICNAME        ",
          "     ,  P.ROWTYPE      AS ROWTYPE             ",
          "     ,  P.PARMNAME     AS PARMNAME            ",
          "     ,  P.LOCATOR      AS LOCATOR             ",
          "     ,  P.ORDINAL      AS ORDINAL             ",
          "     ,  P.TYPENAME     AS TYPENAME            ",
          "     ,  P.LENGTH       AS LENGTH              ",
          "     ,  P.SCALE        AS SCALE               ",
          "     ,  P.ROUTINETYPE  AS ROUTINETYPE         ",
          "     ,  R.RESULT_SETS                         ",
          "FROM "SYSIBMS".SYSPARMS P                     ",
          "INNER JOIN "SYSIBMS".SYSROUTINES R            ",
          "  ON  P.SCHEMA       = R.SCHEMA               ",
          "  AND P.NAME         = R.NAME                 ",
          "  AND P.SPECIFICNAME = R.SPECIFICNAME         ",
          "WHERE P.SCHEMA        = '"PROC_CREATOR"'      ",
          "AND   P.NAME          = '"PROC_NAME"'         ",
          "ORDER BY ORDINAL                              ",
          ""

AUSWKZ = "SQLEX"
object  = sqlstmt
call Lesen_daten

ADDRESS ISPEXEC  'TBOPEN  'SELTAB
ADDRESS ISPEXEC  'TBTOP   'SELTAB
ADDRESS ISPEXEC  'TBSKIP  'SELTAB

OK = Nexttab( "Call    " Object1 "(" , al.)
komma = "   "
NUMWERTE = "INTEGER SMALLINT BIGINT DECIMAL FLOAT DECFLOAD "

do while rc = 0
   ROUTINENAME    = COL1
   ROUTINESCHEMA  = COL2
   SPECIFICNAME   = COL3
   ROWTYPE        = COL4
   PARMNAME       = COL5
   LOCATOR        = COL6
   ORDINAL        = COL7
   TYPENAME       = COL8
   LENGTH         = COL9
   SCALE          = COL10
   ROUTINETYPE    = COL11
   select
     When POS(TYPENAME, NUMWERTE,  1) > 0 Then do
        INFO = ""
        INFO = "-- ",
               ROWTYPE SUBSTR(PARMNAME, 1, 20) TYPENAME LENGTH SCALE
        OK = Nexttab(komma " 0       "Info  , al.)
      End
     OTHERWISE Do
        INFO = ""
        INFO = "-- " ,
               ROWTYPE SUBSTR(PARMNAME, 1, 20) TYPENAME LENGTH
        OK = Nexttab(komma "''       "Info  , al.)
      End
   End
   komma = ",  "
   ADDRESS ISPEXEC  'TBSKIP  'SELTAB
 End
ADDRESS ISPEXEC  'TBCLOSE 'SELTAB
ADDRESS ISPEXEC  'TBERASE 'SELTAB

ADDRESS ISPEXEC  'TBCLOSE 'SELTAB
ADDRESS ISPEXEC  'TBERASE 'SELTAB
OK = Nexttab( " ) "                              , al. )
OK = Nexttab( "; "                               , al. )

Return

Alter_Index_Add_Column:

objecto      = object
object       = ""
object2      = Space(TBCREATOR '.' TBNAME, 0)
call Lesen_daten
object       = objecto

CZeile  = ""
COLTAB = "COLTB"tabnr
address ispexec 'TBOPEN  'COLTAB
address ispexec 'TBTOP   'COLTAB
address ispexec 'TBSKIP  'COLTAB
area.0  = 4
area.1  = white"Alter Index "Space(Creator "." name, 0) ix_Function
area.2  = white"                                             "
area.3  = white"    COLNO  " ,
                    Left("NAME", 45) ,
                    Left("COLTYPE", 8) ,
               "N D H G"
area.4  = white"                                             "
Do while RC = 0

   SEL = " "
   parse value CZeile with TBCREATOR             '0a0d'x ,
                           TBNAME                '0a0d'x ,
                           COLNO                 '0a0d'x ,
                           NAME                  '0a0d'x ,
                           COLTYPE               '0a0d'x ,
                           LENGTH                '0a0d'x ,
                           SCALE                 '0a0d'x ,
                           LENGTH2               '0a0d'x ,
                           NULLS                 '0a0d'x ,
                           DEFAULT               '0a0d'x ,
                           HIDDEN                '0a0d'x ,
                           COLCARDF              '0a0d'x ,
                           KEYSEQ                '0a0d'x ,
                           PARTKEY_COLSEQ        '0a0d'x ,
                           PARTKEY_ORDERING      '0a0d'x ,
                           GENERATED_ATTR        '0a0d'x ,
                           .

   area.0 = area.0 + 1
   ai     = area.0
   COLNO   = Right(COLNO, 3, '0')
   area.ai = white"   "keyw"S" || COLNO""in1 || SEL || endin ,
             Left(NAME, 45)   ,
             Left(COLTYPE, 8) ,
             NULLS            ,
             DEFAULT          ,
             HIDDEN           ,
             GENERATED_ATTR   ,
             ""
   maxcolno = colno
   address ispexec 'TBSKIP  'COLTAB
 End

Call Anzeige_Dyn_Panel


Do awnr = 1 to maxcolno
   Ausw = "S" || Right(awnr, 3, '0') || "_Val"
   If "S" = Value(Ausw) Then do
      address ispexec 'TBTOP   'COLTAB
      address ispexec 'TBSKIP  'COLTAB' NUMBER('awnr')'
      parse value CZeile with TBCREATOR             '0a0d'x ,
                              TBNAME                '0a0d'x ,
                              COLNO                 '0a0d'x ,
                              NAME                  '0a0d'x ,
                              COLTYPE               '0a0d'x ,
                              .

      OK = Nexttab( "Alter Index    " Index_Name , al.)
      OK = Nexttab( "      "ix_Function "(" NAME ")", al. )
      OK = Nexttab( "; "                               , al. )
    End

 End

address ispexec 'TBCLOSE 'COLTAB
Return

Alter_Table:


parse value CZeile with CREATOR               '0a0d'x ,
                        NAME                  '0a0d'x ,
                        TYPE                  '0a0d'x ,
                        DBNAME                '0a0d'x ,
                        TSNAME                '0a0d'x ,
                        TBCREATOR             '0a0d'x ,
                        TBNAME                '0a0d'x ,
                        VERSIONING_SCHEMA     '0a0d'x ,
                        VERSIONING_TABLE      '0a0d'x ,
                        ARCHIVING_SCHEMA      '0a0d'x ,
                        ARCHIVING_TABLE       '0a0d'x ,
                        PARENTS               '0a0d'x ,
                        CHILDREN              '0a0d'x ,
                        CARD                  '0a0d'x ,
                        COLCOUNT              '0a0d'x ,
                        CHECKS                '0a0d'x ,
                        STATUS                '0a0d'x ,
                        TABLESTATUS           '0a0d'x ,
                        CHECKFLAG             '0a0d'x ,
                        DATACAPTURE           '0a0d'x ,
                        SPLIT_ROWS            '0a0d'x ,
                        APPEND                '0a0d'x ,
                        AUDITING              '0a0d'x ,
                        VALPROC               '0a0d'x ,
                        CLUSTERTYPE           '0a0d'x ,
                        HASHKEYCOLUMNS        '0a0d'x ,
                        STATS_FEEDBACK        '0a0d'x ,
                        PARTKEYCOLNUM         '0a0d'x ,
                        MAXPARTITIONS         '0a0d'x ,
                        RECLENGTH             '0a0d'x ,
                        mREATEDTS             '0a0d'x ,
                        ALTEREDTS             '0a0d'x ,
                        STATSTIME             '0a0d'x ,
                        REMARKS               '0a0d'x ,
                        .


VS_TAB = Space(VERSIONING_SCHEMA "." VERSIONING_TABLE, 0)
AR_TAB = Space(ARCHIVING_SCHEMA  "." ARCHIVING_TABLE , 0)
IF VS_TAB = "." Then VS_TAB = ""
IF AR_TAB = "." Then AR_TAB = ""
If SPLIT_ROWS     = " " Then SPLIT_ROWS  = "N"
If DATACAPTURE    = " " Then DATACAPTURE = "N"
If AUDITING       = " " Then AUDITING    = "N"
If CLUSTERTYPE    = " " Then CLUSTERTYPE = "N"
DATACAPTURE       = Left(DATACAPTURE ,  1, ' ')
VOLATILE          = Left(SPLIT_ROWS  ,  1, ' ')
APPEND            = Left(APPEND      ,  1, ' ')
AUDIT             = Left(AUDITING    ,  1, ' ')
RACCONTROL        = " "
VALPROC           = Left(VALPROC     ,  8, ' ')
CloneYN           = Left(' '         ,  1, ' ')
CloneTab          = Left(' '         , 60, ' ')
VersioningYN      = Left(' '         ,  1, ' ')
Versioning_tab    = Left(VS_TAB      , 60, ' ')
ArchivingYN       = Left(' '         ,  1, ' ')
Archiving_Tab     = Left(AR_TAB      , 60, ' ')
mehr              = Left(' '         ,  1, ' ')
NewName           = Left(' '         , 50, ' ')
Partname          = Left(' '         , 40, ' ')

area.0  = 25
area.1  = white"Alter Table "Space(Creator "." name, 0)
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"   "keyw"DATACAPTURE       "in1 || DATACAPTURE|| endin ,
          white"       N=NONE / C=CHANGES "
area.5  = white"   "keyw"VOLATILE          "in1 || VOLATILE   || endin ,
          white"       Y/N "
area.6  = white"   "keyw"APPEND            "in1 || APPEND     || endin ,
          white"       Y/N "
area.7  = white"   "keyw"AUDIT             "in1 || AUDIT      || endin ,
          white"       N=NONE / C=CHANGES / A=ALL "
area.8  = white"   "keyw"VALPROC           "in1 || VALPROC    || endin ,
          white"ValProg / Null "
area.9  = white" "
area.10 = white"   "keyw"ROW_ACCESS_CONTROL" || ,
            In1 || RACCONTROL || endin ,
          white"       A=ACTIVATE / D=DACTIVATE "
area.11 = white"   "keyw"RESTRICT ON DROP " ,
            In1 || CLUSTERTYPE || endin ,
          white"       N=Drop / Y=ADD "
area.12 = white" "
area.13 = white" "
area.14 = white"   "keyw"Versioning "in1 || VersioningYN || endin ,
          white" D=Drop/A=Add            "
area.15 = white"   "keyw"Vers_Table "in1 || Versioning_Tab || endin
area.16 = white"   "keyw"Archiving  "in1 || ArchivingYN || endin ,
          white" D=Drop/A=Add            "
area.17 = white"   "keyw"Arch_Table "in1 || Archiving_Tab || endin
area.18 = white"   "keyw"Clone "in1 || CloneYN  || endin ,
          white" D=Drop/A=Add/E=Exchange "
area.19 = white"   "keyw"Table "in1 || CloneTab || endin
area.20 = white" "
area.21 = white" "
area.22 = white"   "keyw"RenameTable :"in1 || NewName  || endin
area.23 = white"   "keyw"AddPartition "in1 || Partname || endin,
          white" MAX-,MIN-, VALUE    "
area.24 = white" "
area.25 = white" "

Call Anzeige_Dyn_Panel


If Strip(DATACAPTURE_Val) <> DATACAPTURE    Then Do
   If Substr(DATACAPTURE_VAL  , 1, 1) = "N" Then TXTVal = 'NONE'
   Else                                          TXTVal = 'CHANGES'
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      DATA CAPTURE "TXTVal  , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(VOLATILE_Val) <> VOLATILE    Then Do
   If Substr(VOLATILE_Val,1, 1) = "N" Then TXTVal   = 'NOT'
   Else                                    TXTVal   = '   '
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      "TXTVal" VOLATILE " , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(APPEND_Val) <> APPEND      Then Do
   If Substr(APPEND_Val,1, 1) = "N" Then TXTVal = 'NO'
   Else                                  TXTVal = 'YES'
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      APPEND      "TXTVal   , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(AUDIT_Val) <> AUDIT       Then Do
   Select
     When  Substr(AUDIT_Val,1, 1) = "N" Then TXTVal = 'NONE'
     When  Substr(AUDIT_Val,1, 1) = "C" Then TXTVal = 'CHANGES'
     When  Substr(AUDIT_Val,1, 1) = "A" Then TXTVal = 'ALL'
     Otherwise                               TXTVal = 'NONE'
   End
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      AUDIT   "TXTVal   , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(RESTRICT_Val) <> CLUSTERTYPE Then Do
   Select
     When  Substr(RESTRICT_Val, 1, 1) = "Y" Then TXTVal = 'ADD'
     Otherwise                               TXTVal = 'DROP'
   End
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      "TXTVal" RESTRICT ON DROP ", al.)
   OK = Nexttab( "; "                               , al. )
 End

If Strip(VALPROC_Val) <> VALPROC     Then Do
   VALPROC_Val  = Strip(VALPROC_Val)
   Select
     When  Strip(VALPROC_Val)      = "NULL" Then TXTVal = 'NULL'
     When  Length(VALPROC_Val)     = 0      Then TXTVal = 'NULL'
     Otherwise                                   TXTVal = VALPROC_Val
   End
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      VALIDPROC "TXTVal   , al. )
   OK = Nexttab( "; "                               , al. )
 End

If Strip(ROW_ACCESS_CONTROL_VAL) <>  RACCONTROL Then do
   Select
     When  Strip(ROW_ACCESS_CONTROL_VAL) = "D"  THEN ACT= "DEACTIVATE"
     Otherwise                                       ACT= "ACTIVATE"
   End
   OK = Nexttab( "Alter Table    " Space(Creator "." name, 0), al.)
   OK = Nexttab( "      "ACT" ROW ACCESS CONTROL", al.)
   OK = Nexttab( "; "                               , al. )
 End

If Strip(Clone_Val) <> CloneYN     Then Do
   Select
     When  Strip(Clone_Val)      = "A" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      ADD  CLONE "Table_Val, al. )
      End
     When  Strip(Clone_Val)      = "D" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      DROP CLONE"         , al. )
      End
     When  Strip(Clone_Val)      = "E" Then Do
           OK = Nexttab( "EXCHANGE DATA BETWEEN TABLE " , al. )
           OK = Nexttab( "         "Space(Creator "." name, 0), al.)
           OK = Nexttab( "     AND "Table_Val           , al. )
      End
     Otherwise Do
           OK = Nexttab( "EXCHANGE DATA BETWEEN TABLE " , al. )
           OK = Nexttab( "         "Space(Creator "." name, 0), al.)
           OK = Nexttab( "     AND "Table_Val           , al. )
      End
   End
   OK = Nexttab( "; "                               , al. )
 End

If Strip(   Versioning_Val) <> VersioningYN Then Do
   Select
     When  Strip(Versioning_Val) = "A" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      ADD VERSIONING "              , al. )
           OK = Nexttab( "      USE HISTORY TABLE "Vers_Table_Val, al. )
           OK = Nexttab( "; "                               , al. )
      End
     When  Strip(Versioning_Val) = "D" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      DROP VERSIONING "   , al. )
           OK = Nexttab( "; "                               , al. )
      End
     Otherwise NOP
   End
 End

If Strip(   Archiving_Val)  <> ArchivingYN Then Do
   Select
     When  Strip(Archiving_Val) = "A" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      ENABLE ARCHIVE USE "Arch_Table_Val, al.)
           OK = Nexttab( "; "                       , al. )
      End
     When  Strip(Archiving_Val) = "D" Then Do
           OK = Nexttab( "Alter Table    " ,
                          Space(Creator "." name, 0), al.)
           OK = Nexttab( "      DISABLE ARCHIVE "   , al. )
           OK = Nexttab( "; "                       , al. )
      End
     Otherwise NOP
   End
 End

If Strip(RenameTable_val)<> NewName     Then Do
   OK = Nexttab( "RENAME TABLE   " Space(Creator "." name, 0), al.)
   OK = Nexttab( "       TO      " Strip(RenameTable_val)    , al.)
   OK = Nexttab( "; "                               , al. )
 End

If Strip(AddPartition_val)<> Partname    Then Do
   OK = Nexttab( "ALTER TABLE " Space('"' Creator '"."'name'"',0) , al.)
   OK = Nexttab( "      ADD PARTITION ENDING AT (" || ,
                 Strip(AddPartition_val) || ")" , al.)
   OK = Nexttab( "; "                               , al. )
 End

Return


COMMENT_On_Object:


Select
   when auswkz = 'TB'   Then Do
        AOBJ = 'TABLE '
        parse value CZeile with CREATOR               '0a0d'x ,
                                NAME                  '0a0d'x ,
                                TYPE                  '0a0d'x ,
                                DBNAME                '0a0d'x ,
                                TSNAME                '0a0d'x ,
                                TBCREATOR             '0a0d'x ,
                                TBNAME                '0a0d'x ,
                                VERSIONING_SCHEMA     '0a0d'x ,
                                VERSIONING_TABLE      '0a0d'x ,
                                ARCHIVING_SCHEMA      '0a0d'x ,
                                ARCHIVING_TABLE       '0a0d'x ,
                                PARENTS               '0a0d'x ,
                                CHILDREN              '0a0d'x ,
                                CARD                  '0a0d'x ,
                                COLCOUNT              '0a0d'x ,
                                CHECKS                '0a0d'x ,
                                STATUS                '0a0d'x ,
                                TABLESTATUS           '0a0d'x ,
                                CHECKFLAG             '0a0d'x ,
                                DATACAPTURE           '0a0d'x ,
                                SPLIT_ROWS            '0a0d'x ,
                                APPEND                '0a0d'x ,
                                AUDITING              '0a0d'x ,
                                VALPROC               '0a0d'x ,
                                CLUSTERTYPE           '0a0d'x ,
                                HASHKEYCOLUMNS        '0a0d'x ,
                                STATS_FEEDBACK        '0a0d'x ,
                                PARTKEYCOLNUM         '0a0d'x ,
                                MAXPARTITIONS         '0a0d'x ,
                                RECLENGTH             '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                ALTEREDTS             '0a0d'x ,
                                STATSTIME             '0a0d'x ,
                                TEST                  '0a0d'x ,
                                REMARKS                '0a0d'x    ,
                                LABEL                  '0a0d'x    ,
                                .
    End
   when auswkz = 'VW'   Then Do
        AOBJ = 'TABLE '
        parse value CZeile with DCREATOR              '0a0d'x ,
                                DNAME                 '0a0d'x ,
                                BTYPE                 '0a0d'x ,
                                BCREATOR              '0a0d'x ,
                                BNAME                 '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                LABEL                 '0a0d'x     ,
                                .
    End
   when auswkz = 'AL'   Then Do
        AOBJ = 'ALIAS '
        parse value CZeile with CREATOR               '0a0d'x ,
                                NAME                  '0a0d'x ,
                                TYPE                  '0a0d'x ,
                                LOCATION              '0a0d'x ,
                                TBCREATOR             '0a0d'x ,
                                TBNAME                '0a0d'x     ,
                                TBTYPE                '0a0d'x     ,
                                REMARKS               '0a0d'x     ,
                                LABEL                 '0a0d'x     ,
                                .
    End
   when auswkz = 'IX'   Then Do
        AOBJ = 'INDEX '
        parse value CZeile with Creator               '0a0d'x ,
                                NAME                  '0a0d'x ,
                                TBCREATOR             '0a0d'x ,
                                TBNAME                '0a0d'x ,
                                BPOOL                 '0a0d'x ,
                                DBNAME                '0a0d'x ,
                                INDEXSPACE            '0a0d'x ,
                                HASH                  '0a0d'x ,
                                CLUSTERING            '0a0d'x ,
                                CLUSTERED             '0a0d'x ,
                                UNIQUERULE            '0a0d'x ,
                                FULLKEYCARD           '0a0d'x ,
                                CLOSERULE             '0a0d'x ,
                                COPY                  '0a0d'x ,
                                PIECESIZE             '0a0d'x ,
                                PADDED                '0a0d'x ,
                                COMPRESS              '0a0d'x ,
                                INDEXTYPE             '0a0d'x ,
                                SPARSE                '0a0d'x ,
                                VERSION               '0a0d'x ,
                                CLUSTERRATIOF         '0a0d'x ,
                                FIRSTKEYCARDF         '0a0d'x ,
                                FULLKEYCARDF          '0a0d'x ,
                                NLEAF                 '0a0d'x ,
                                NLEVELS               '0a0d'x ,
                                IX_EXTENSION_TYPE     '0a0d'x ,
                                IX_EXTENSION_TYPE2    '0a0d'x ,
                                KEYTARGET_COUNT       '0a0d'x ,
                                UNIQUE_COUNT          '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                        .
    End
   when auswkz = 'CO'   Then Do
        AOBJ = 'COLUMN  '
        parse value CZeile with TBCREATOR             '0a0d'x ,
                                TBNAME                '0a0d'x ,
                                COLNO                 '0a0d'x ,
                                NAME                  '0a0d'x ,
                                COLTYPE               '0a0d'x ,
                                LENGTH                '0a0d'x ,
                                SCALE                 '0a0d'x ,
                                LENGTH2               '0a0d'x ,
                                NULLS                 '0a0d'x ,
                                DEFAULT               '0a0d'x ,
                                HIDDEN                '0a0d'x ,
                                COLCARDF              '0a0d'x ,
                                KEYSEQ                '0a0d'x ,
                                PARTKEY_COLSEQ        '0a0d'x ,
                                PARTKEY_ORDERING      '0a0d'x ,
                                GENERATED_ATTR        '0a0d'x ,
                                UPDATES               '0a0d'x ,
                                FOREIGNKEY            '0a0d'x ,
                                CCSID                 '0a0d'x ,
                                FLDPROC               '0a0d'x ,
                                COLSTATUS             '0a0d'x ,
                                TYPENAME              '0a0d'x ,
                                HASHKEY_COLSEQ        '0a0d'x ,
                                STATS_FORMAT          '0a0d'x ,
                                PERIOD                '0a0d'x ,
                                DEFAULTVALUE          '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                LABEL                 '0a0d'x     ,
                                .
    End
   when auswkz = 'PG'   Then Do
        AOBJ = 'PACKAGE '
    End
   when auswkz = 'PL'   Then Do
        AOBJ = 'PLAN  '
    End
   when auswkz = 'RT'   Then Do
        AOBJ = 'PROCEDURE '
        parse value CZeile with SCHEMA                '0a0d'x ,
                                NAME                  '0a0d'x ,
                                ROUTINETYPE           '0a0d'x ,
                                SPECIFICNAME          '0a0d'x ,
                                LANGUAGE              '0a0d'x ,
                                ROUTINEID             '0a0d'x ,
                                ORIGIN                '0a0d'x ,
                                FUNCTION_TYPE         '0a0d'x ,
                                PARM_COUNT            '0a0d'x ,
                                COLLID                '0a0d'x ,
                                SQL_DATA_ACCESS       '0a0d'x ,
                                DBINFO                '0a0d'x ,
                                WLM_ENVIRONMENT       '0a0d'x ,
                                WLM_ENV_FOR_NESTED    '0a0d'x ,
                                PROGRAM_TYPE          '0a0d'x ,
                                EXTERNAL_SECURITY     '0a0d'x ,
                                COMMIT_ON_RETURN      '0a0d'x ,
                                RESULT_SETS           '0a0d'x ,
                                LOBCOLUMNS            '0a0d'x ,
                                EXTERNAL_NAME         '0a0d'x ,
                                PARAMETER_CCSID       '0a0d'x ,
                                VERSION               '0a0d'x ,
                                ACTIVE                '0a0d'x ,
                                DEBUG_MODE            '0a0d'x ,
                                TEXT_ENVID            '0a0d'x ,
                                RELCREATED            '0a0d'x ,
                                SECURE                '0a0d'x ,
                                SYSTEM_DEFINED        '0a0d'x ,
                                INLINE                '0a0d'x ,
                                PACKAGEPATH           '0a0d'x ,
                                RUNOPTS               '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
        Select
         When ROUTINETYPE   = 'P' Then Do
              AOBJ       = "PROCEDURE  "
          End
         When ROUTINETYPE   = 'F' Then Do
              AOBJ       = "FUNCTION "
          End
         otherwise  NOP
         End
    End
   when auswkz = 'RO'   Then Do
        AOBJ = 'ROLE  '
        DB2_CREATOR1 = ""
        parse value CZeile with NAME                  '0a0d'x ,
                                DEFINER               '0a0d'x ,
                                DEFINERTYPE           '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                RELCREATED            '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
    End
   when auswkz = 'SE'   Then Do
        AOBJ = 'SEQUENCE '
        parse value CZeile with SCHEMA                '0a0d'x ,
                                NAME                  '0a0d'x ,
                                SEQTYPE               '0a0d'x ,
                                DCREATOR              '0a0d'x ,
                                DNAME                 '0a0d'x ,
                                DCOLNAME              '0a0d'x ,
                                SEQUENCEID            '0a0d'x ,
                                INCREMENT             '0a0d'x ,
                                START                 '0a0d'x ,
                                MAXVALUE              '0a0d'x ,
                                MINVALUE              '0a0d'x ,
                                MAXASSIGNEDVAL        '0a0d'x ,
                                CYCLE                 '0a0d'x ,
                                CACHE                 '0a0d'x ,
                                ORDER                 '0a0d'x ,
                                DATATYPEID            '0a0d'x ,
                                SOURCETYPEID          '0a0d'x ,
                                PRECISION             '0a0d'x ,
                                RESTARTWITH           '0a0d'x ,
                                SEQSCHEMA             '0a0d'x ,
                                SEQNAME               '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                ALTEREDTS             '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
    End
   when auswkz = 'TG'   Then Do
        AOBJ = 'TRIGGER  '
        parse value CZeile with NAME                  '0a0d'x ,
                                SCHEMA                '0a0d'x ,
                                TBNAME                '0a0d'x ,
                                TBOWNER               '0a0d'x ,
                                TRIGTIME              '0a0d'x ,
                                TRIGEVENT             '0a0d'x ,
                                TRIGNAME              '0a0d'x ,
                                GRANULARITY           '0a0d'x ,
                                SECURE                '0a0d'x ,
                                SQLPL                 '0a0d'x ,
                                DEBUG_MODE            '0a0d'x ,
                                OWNER                 '0a0d'x ,
                                CREATEDBY             '0a0d'x ,
                                ASUTIME               '0a0d'x ,
                                WLM_ENVIRONMENT       '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                ALTEREDTS             '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
    End
   when auswkz = 'TCO'  Then Do
        AOBJ = 'TRUSTED CONTEXT '
        DB2_CREATOR1 = ""
        parse value CZeile with NAME                  '0a0d'x ,
                                CONTEXTID             '0a0d'x ,
                                DEFINER               '0a0d'x ,
                                DEFINERTYPE           '0a0d'x ,
                                SYSTEMAUTHID          '0a0d'x ,
                                DEFAULTROLE           '0a0d'x ,
                                OBJECTOWNERTYPE       '0a0d'x ,
                                CREATEDTSTY           '0a0d'x ,
                                ALTEREDTS             '0a0d'x ,
                                ENABLED               '0a0d'x ,
                                ALLOWPUBLIC           '0a0d'x ,
                                AUTHENTICATEPUBLIC    '0a0d'x ,
                                RELCREATED            '0a0d'x ,
                                DEFAULTSECURITYLABEL  '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
    End
   when auswkz = 'DT'   Then Do
        AOBJ = 'TYPE            '
        parse value CZeile with SCHEMA                '0a0d'x ,
                                OWNER                 '0a0d'x ,
                                NAME                  '0a0d'x ,
                                CREATEDBY             '0a0d'x ,
                                SOURCESCHEMA          '0a0d'x ,
                                SOURCETYPE            '0a0d'x ,
                                METATYPE              '0a0d'x ,
                                DATATYPEID            '0a0d'x ,
                                SOURCETYPEID          '0a0d'x ,
                                LENGTH                '0a0d'x ,
                                SCALE                 '0a0d'x ,
                                SUBTYPE               '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                ENCODING_SCHEME       '0a0d'x ,
                                IBMREQD               '0a0d'x ,
                                REMARKS               '0a0d'x,
                                OWNERTYPE             '0a0d'x ,
                                RELCREATED            '0a0d'x ,
                                INLINE_LENGTH         '0a0d'x ,
                                ARRAYLENGTH           '0a0d'x ,
                                ARRAYINDEXTYPEID      '0a0d'x ,
                                ARRAYINDEXTYPELEN     '0a0d'x ,
                                ARRAYINDEXSUBTYPE     '0a0d'x ,
                                .
    End
   when auswkz = 'PERM' Then Do
        AOBJ = 'PERMISSION      '
        parse value CZeile with CONTROL_ID            '0a0d'x ,
                                SCHEMA                '0a0d'x ,
                                NAME                  '0a0d'x ,
                                TBSCHEMA              '0a0d'x ,
                                TBNAME                '0a0d'x ,
                                TBCORRELATION         '0a0d'x ,
                                COLNAME               '0a0d'x ,
                                COLNO                 '0a0d'x ,
                                CONTROL_TYPE          '0a0d'x ,
                                ENFORCED              '0a0d'x ,
                                IMPLICIT              '0a0d'x ,
                                ENABLE                '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .

        Select
         When CONTROL_TYPE  = 'R' Then Do
              AOBJ       = "PERMISSION "
          End
         When CONTROL_TYPE  = 'M' Then Do
              AOBJ       = "MASK "
          End
         otherwise  NOP
         End
    End
   when auswkz = 'VAR'  Then Do
        AOBJ = 'VARIABLE        '
        parse value CZeile with VARIDA                '0a0d'x ,
                                SCHEMA                '0a0d'x ,
                                NAME                  '0a0d'x ,
                                TYPESCHEMA            '0a0d'x ,
                                TYPENAME              '0a0d'x ,
                                LENGTH                '0a0d'x ,
                                SCALE                 '0a0d'x ,
                                SOURCETYPEID          '0a0d'x ,
                                CCSID                 '0a0d'x ,
                                ENVID                 '0a0d'x ,
                                DEFAULT               '0a0d'x ,
                                DEFAULTTEXT           '0a0d'x ,
                                OWNER                 '0a0d'x ,
                                OWNERTYPE             '0a0d'x ,
                                DATATYPEID            '0a0d'x ,
                                CREATEDTS             '0a0d'x ,
                                RELCREATED            '0a0d'x ,
                                REMARKS               '0a0d'x     ,
                                .
    End
   Otherwise Return
  End


if eingabe = "CM"  THEN Do
   CM = Remarks
   cmlen   = 63
   cm1     = SUBSTR(cm, 1, cmlen)
   cm2     = SUBSTR(cm, 1+cmlen*1, cmlen)
   cm3     = SUBSTR(cm, 1+cmlen*2, cmlen)
   cm4     = SUBSTR(cm, 1+cmlen*3, cmlen)
   cm5     = SUBSTR(cm, 1+cmlen*4, cmlen)
   cm6     = SUBSTR(cm, 1+cmlen*5, cmlen)
   cm7     = SUBSTR(cm, 1+cmlen*6, cmlen)
   cm8     = SUBSTR(cm, 1+cmlen*7, cmlen)
   cm9     = SUBSTR(cm, 1+cmlen*8, cmlen)
   cm10    = SUBSTR(cm, 1+cmlen*9, cmlen)
   cm11    = SUBSTR(cm, 1+cmlen*10, cmlen)
   cm12    = SUBSTR(cm, 1+cmlen*11, cmlen)
   cm13    = SUBSTR(cm, 1+cmlen*12, 18        )  /* 762 = cmlen*12+18 */
 End
if eingabe = "LAB" THEN Do
   CM = LABEL
   cm1     = SUBSTR(cm, 1, 30)
   cm2     = ""
   cm3     = ""
   cm4     = ""
   cm5     = ""
   cm6     = ""
   cm7     = ""
   cm8     = ""
   cm9     = ""
   cm10    = ""
   cm11    = ""
   cm12    = ""
   cm13    = ""
 End


If Length(DB2_CREATOR1) < 1 then cmobj = space(DB2_NAME1, 0)
 Else cmobj = Space(DB2_CREATOR1 "." DB2_NAME1,0)
If auswkz = 'CO'  Then cmobj = Strip(cmobj) || "." || DB2_CREATOR2

if eingabe = "CM"  THEN WAS = "COMMENT "
if eingabe = "LAB" THEN WAS = "LABEL "

area.0  = 18
area.1  = white""WAS" ON "AOBJ cmobj " IS "
area.2  = white"                                             "
area.3  = white"                                             "
area.4  = white"                                             "
area.5  = white"   "keyw" "in2 || cm1 || endin
area.6  = white"   "keyw" "in2 || cm2 || endin
area.7  = white"   "keyw" "in2 || cm3 || endin
area.8  = white"   "keyw" "in2 || cm4 || endin
area.9  = white"   "keyw" "in2 || cm5 || endin
area.10 = white"   "keyw" "in2 || cm6 || endin
area.11 = white"   "keyw" "in2 || cm7 || endin
area.12 = white"   "keyw" "in2 || cm8 || endin
area.13 = white"   "keyw" "in2 || cm9 || endin
area.14 = white"   "keyw" "in2 || cm10|| endin
area.15 = white"   "keyw" "in2 || cm11|| endin
area.16 = white"   "keyw" "in2 || cm12|| endin
area.17 = white"   "keyw" "in2 || cm13|| endin
area.18 = white"   "


Call Anzeige_Dyn_Panel


comment = col1_Val   || ,
          col2_Val   || ,
          col3_Val   || ,
          col4_Val   || ,
          col5_Val   || ,
          col6_Val   || ,
          col7_Val   || ,
          col8_Val   || ,
          col9_Val   || ,
          col10_Val  || ,
          col11_Val  || ,
          col12_Val  || ,
          col13_Val  || ,
          ""

Comment = Strip(Comment, 'T')
if WAS = "LABEL"  & Comment = "" Then Comment = " "

If Strip(1              )<> 2           Then Do
   OK = Nexttab( WAS" ON " AOBJ cmobj " IS "    , al.)
   OK = Nexttab( "'" || Comment || "'"              , al.)
   OK = Nexttab( "; "                               , al.)
 End

return



Edit_Stmt:

DSNAME = ZOSB1900("ZOSB1","DSNAME", "STMT", LNR)
LRECL   = RECLEN

IF LISTDSI(DSNAME) = 0 THEN do
    ADDRESS "TSO" "ALLOC F(SELDD) DA("DSNAME") SHR"
 end
else do
    ADDRESS "TSO" "ALLOC F(SELDD) DA("DSNAME") NEW CATALOG ,
          SPACE("TRACKS","TRACKS") TRACKS REUSE,
          LRECL("RECLEN") UNIT(SYSDA)"
 end


ADDRESS "TSO" "EXECIO * DISKW SELDD ( STEM SL. FINIS"
ADDRESS "TSO" "FREE FI(SELDD)"

ok   = ZOSB1911(SSID,     ,
                LOCATION,  ,
                EINGABE,   ,
                OBJ,       ,
                DSNAME,    ,
                LNR   )

return

Get_CFG_FILE:
PARSE SOURCE SRC.1  , /* ENVIRONMENT  (TSO)            */
             SRC.2  , /* AUFRUF ALS (COMMAND)          */
             SRC.3  , /* Program NAME (LUW97000)       */
             SRC.4  , /* SYS00186 (TEMP FILE)          */
             SRC.5  , /* AUFRUF AUS LIB (X.X.CLISTUDB) */
             SRC.6  , /* ?                             */
             SRC.7  , /* TSO                           */
             SRC.8  , /* ISPF                          */
             SRC.9  , /* ?                             */
/*  CFG FILE                            */
mem     = "#SSIDINF"
CFGFILE = Strip(sysdsname) || "(" || mem || ")"
CFGFILE = Strip(proclib) || "(" || mem || ")"
ADDRESS TSO "FREE FILE(CFGF) NOHOLD"
ADDRESS TSO "ALLOC F(CFGF) DATASET('"CFGFILE"') SHR"
ADDRESS TSO "EXECIO * DISKR CFGF (STEM CONFIG. FINIS"
ADDRESS TSO "EXECIO 0 DISKR CFGF ( FINIS"
ADDRESS TSO "FREE FILE(CFGF) NOHOLD"

Do I = 1 TO CONFIG.0
   If Translate(Word(Config.i, 1))     = 'AG' ,
    | TRANSLATE(Word(Config.i, 1))     = SSID Then do
       CMDLINE =  Subword(CONFIG.i, 2)
       INTERPRET  CMDLINE
    End
 End

return 0


Anzeige_Dyn_Panel:

If InitArea <> "N" Then do
   Zeile = 0
   DROP ausgabe.
   ausgabe.0 = 0
   MaxLines = area.0
   curline = 1                        /* set current line #     */
   dyndata  = ""
   ADDRESS ISPEXEC  "VGET (ZSCREENW,ZSCREEND)"
   Do ai = 1 to area.0
      dyndata = dyndata || Left(area.ai, ZSCREENW, ' ')
    end
   dyndata = dyndata || endin
   dynarea = substr(dyndata,1+(curline-1)*ZSCREENW) /*set dyn var  */
   dynarea = dyndata

   MaxScreenLines = ZSCREEND-5
   dyndata_len = Length(dyndata)
   trenner = in1
   START   = Pos(keyw, dyndata, 1)
   If START  < 1 Then START = 1
   DYNPOS  = START + 1
   Do ki = 1 to keytab.0
      Found    = Pos(keytab.ki, dyndata, START )
      If Found > 0  Then Do
         SELECT
           When  DYNPOS =  START + 1   Then dynpos = Found + 1
           When  Found  <  DYNPOS      Then dynpos = Found + 1
           Otherwise NOP
          END
       End
    End
   znr     = 1
 End


NNCount = 0
If EnterBack = "Y" Then PFTASTEN = "ENTER=GO PF03=RETURN PF04=Cancel"
else                    PFTASTEN = "      PF03=GO    PF04=Cancel "

Do Until disprc > 0

  start   = 1+(curline-1)*ZSCREENW
  dynarea = substr(dyndata, Start)
  size = length(dynarea)                   /* Set a scalar variable  */
  ADDRESS ISPEXEC "DISPLAY PANEL(PDYNPNL1)"

  MaxScreenLines = DYNDPTH
  DynArea_len = MaxScreenLines*ZSCREENW
  dyndata1= Substr(dyndata, 1,  1+(curline-1)*ZSCREENW-1)
  start   = Length(dyndata1) + Length(dynarea) + 1
  Dyndata = Dyndata1 || dynarea || Substr(Dyndata, start)
  Eingabe = dynarea
  Eingabe = dyndata

  disprc = rc                              /* save return code       */
  ADDRESS ISPEXEC "VGET (ZVERB,ZSCROLLA,ZSCROLLN, ZSCROLLD) "
  ADDRESS ISPEXEC "VGET (ZXSMAX, ZXSMIN) "
  dynrc = rc
  SELECT                                   /* Process scrolling      */
    When(zverb  = 'UP')   Then Do          /* Scroll up              */
     If zscrolla = 'MAX' Then Do           /*  if scroll was max     */
        curline = 1                       /*    scroll to top       */
      End
     Else Do                               /*  else a number is known*/
      curline = curline - MaxScreenLines        /* (max is bottom)   */
      if curline < 1 then Curline = 1
      End
     End
    When(zverb  = 'DOWN') Then Do          /* Scroll down            */
     If zscrolla = 'MAX' Then Do           /*  if scroll was max     */
      curline = maxlines                   /*    scroll to bottom    */
     end
     Else do                               /*  else a number is known*/
      curline = curline + MaxScreenLines        /* (max is bottom)   */
      If curline > maxlines Then Curline = maxlines
      if DynArea_len >= dyndata_len Then Do  /* NUR EINE SEITE */
         curline = 1
       End
      end
     end
    Otherwise;                      /* could use left & right too    */
  End
  if dynrc > 8 then Do
     say "Display RC="RC
     say "ZEDSMSG="ZEDSMSG
     say "ZERRLM="ZERRLM
     say "ZERRMSG="ZERRMSG
     say "ZERRSM="ZERRSM
     say rc object1
   End

  DO While Length(eingabe) > 0
     Zeile = zeile + 1
     trenner = in1

     FoundL = 0
     Do ki = 1 to keytab.0
        Found    = Pos(keytab.ki, eingabe, 1)
        If Found = 0 Then Iterate
        Select
          When FoundL = 0 Then Do
               Trenner = keytab.KI
               FoundL  = Found
           End
          When FoundL > 0 & Found < FoundL Then Do
               Trenner = keytab.KI
               FoundL  = Found
           End
          Otherwise NOP
         End
      End

     /*    Keyword Finden   */
     epos     = Pos(keyw, eingabe, 1)
     xpos     = Pos(Trenner, eingabe, epos+1)
     elen     = xpos - epos -1
     If    elen < 0 Then Leave
     Keyword  =  Substr(eingabe, epos+1, elen  )
     Keyword  =  Word(Keyword, 1)

     If Length(Keyword) < 1 Then Do
        NNCount = NNCount + 1
        KeyWord = "Col" || NNCount
      End

     /*    EINGABE Finden   */
     epos     = Pos(Trenner, eingabe, 1)
     if epos  < 1 then leave
     xpos     = Pos(endin, eingabe, epos+1)
     elen     = xpos - epos -1
     if elen < 1 then Do
        If Length(KeyWord) > 0 Then evalue = ""
      End
     Else evalue   = Substr(eingabe, epos+1, elen  )
     eingabe  = Substr(eingabe, xpos+ 1)

     Interpret Strip(Keyword) || "_VAL" "= evalue"
   End
   If PF = 'PF03'               THEN LEAVE
   If PF = 'PF04'               THEN EXIT 4
   If RESP = "ENTER" & EnterBack = "Y" Then return
End                                        /* End of display loop    */

Return


Anzeige_Dyn_Panel_Neu:

ADDRESS ISPEXEC  "VGET (ZSCREENW,ZSCREEND)"
dyndata = ""
Do ai = 1 to area.0
   dyndata = dyndata || Left(area.ai, ZSCREENW, ' ')
 end

If InitArea  <> "N" THEN InitArea  = "Y"
If EnterBack <> "Y" THEN EnterBack = "N"

Call ZOSB1906 DYNDATA ,,
              EnterBack ,,
              InitArea

Do QUEUED()
   Parse pull Text
   Interpret Text
 End

PF = RESULT
IF PF = "ENTER" THEN RESP = PF
IF PF = "PF04" Then exit 4

Return

Lesen_daten:

LOC  = LOCATION
FK   = AUSWKZ
OB   = object
OB2  = Object2
OB3  = Object3
OB4  = Object4
OB5  = Object5
TS   = Tablespace
DB   = DATABASE
SG   = STGROUP
LOBJ = ListObject

DDLTEXT = ""
DDLTEXT = DDLTEXT ZOSB1AC3(SSID,   ,           /* SSID    */
                           EDIT_SQL,,          /* Edit SQL */
                           LOC,    ,           /* LOCATION */
                           LNR,    ,           /* TABLENR */
                           TABNR,  ,           /* TABLENR */
                           FK,     ,           /* FUKTION */
                           OB,     ,           /* OBJECT  */
                           OB2,    ,           /* TABLE   */
                           OB3,    ,           /* TABLE   */
                           OB4,    ,           /* TABLE   */
                           OB5,    ,           /* TABLE   */
                           TS,     ,           /* TABLESPACE */
                           DB,     ,           /* DATABASE   */
                           SG,     ,           /* STORAGEGROUP */
                           LOBJ,   ,           /* List Object*/
                           ISPFILE)            /* ISPFILE    */

DDLTEXT = STRIP(DDLTEXT)
IF LENGTH(DDLTEXT) = 0 THEN DO
   X        = MSG('ON')
   ZEDSMSG = ""
   ZEDLMSG = " -KEIN TREFFER ZUR AUSWAHL- "
   ADDRESS ISPEXEC "SETMSG MSG(ISRZ001)"
   X        = MSG('OFF')
   RETURN 0
 End

DO FOREVER
   PARSE VALUE DDLTEXT WITH LZEILE  '-NR' REST
   IF SUBSTR(LZEILE, 1, 4) = "*UZ*" THEN DO
      UZeile = substr(LZeile, 5)
    end
   IF REST = '' THEN LEAVE
   DDLTEXT = REST
 END


return

Auto_Parse:
/* Zuweisen der CZeile zu den Column Names */

address ispexec "TBOPEN " TBCOL
Address ISPEXEC "TBTOP  " TBCOL
Address ISPEXEC "TBSKIP" TBCOL

PZeile = CZeile
do while rc = 0
   parse value PZeile with PVal "0a0d"x  PZeile
   CLName = Translate(CLNAME, '_', '-')
   interpret STRIP(CLNAME) ' = "'Strip(PVAL)'"'
   Address ISPEXEC "TBSKIP" TBCOL
end

address ispexec "TBCLOSE" TBCOL

return 0


NextTab:
text = arg(1)
tab  = arg(2)
If EDIT = "YES" then tab = sl.  /* WENN EDIT DANN SQL */

ind  = Value(tab || 0)
ind  = ind + 1
interpret tab || "0 = ind"
interpret tab || "ind = arg(1) "
return 0

error: failure: syntax: novalue:
return
